{
    "ansible.netcommon.net_user": {
        "doc": {
            "author": "Trishna Guha (@trishnaguha)",
            "collection": "ansible.netcommon",
            "deprecated": {
                "alternative": "Use platform-specific \"[netos]_user\" module",
                "removed_from_collection": "ansible.netcommon",
                "removed_in": "2.13",
                "why": "Updated modules released with more functionality"
            },
            "description": [
                "This module provides declarative management of the local usernames configured on network devices. It allows playbooks to manage either individual usernames or the aggregate of usernames in the current running config. It also supports purging usernames from the configuration that are not explicitly defined."
            ],
            "filename": "/Users/ssbarnea/.ansible/collections/ansible_collections/ansible/netcommon/plugins/modules/net_user.py",
            "has_action": true,
            "module": "net_user",
            "notes": [
                "This module is supported on C(ansible_network_os) network platforms. See the :ref:`Network Platform Options <platform_options>` for details."
            ],
            "options": {
                "aggregate": {
                    "description": [
                        "The set of username objects to be configured on the remote network device. The list entries can either be the username or a hash of username and properties. This argument is mutually exclusive with the C(name) argument."
                    ]
                },
                "configured_password": {
                    "description": [
                        "The password to be configured on the remote network device. The password needs to be provided in clear and it will be encrypted on the device. Please note that this option is not same as C(provider password)."
                    ]
                },
                "name": {
                    "description": [
                        "The username to be configured on the remote network device. This argument accepts a string value and is mutually exclusive with the C(aggregate) argument. Please note that this option is not same as C(provider username)."
                    ]
                },
                "nopassword": {
                    "description": [
                        "Defines the username without assigning a password. This will allow the user to login to the system without being authenticated by a password."
                    ],
                    "type": "bool"
                },
                "privilege": {
                    "description": [
                        "The C(privilege) argument configures the privilege level of the user when logged into the system. This argument accepts integer values in the range of 1 to 15."
                    ]
                },
                "purge": {
                    "default": false,
                    "description": [
                        "Instructs the module to consider the resource definition absolute. It will remove any previously configured usernames on the device with the exception of the `admin` user (the current defined set of users)."
                    ],
                    "type": "bool"
                },
                "role": {
                    "description": [
                        "Configures the role for the username in the device running configuration. The argument accepts a string value defining the role name. This argument does not check if the role has been configured on the device."
                    ]
                },
                "sshkey": {
                    "description": [
                        "Specifies the SSH public key to configure for the given username. This argument accepts a valid SSH key value."
                    ]
                },
                "state": {
                    "choices": [
                        "present",
                        "absent"
                    ],
                    "default": "present",
                    "description": [
                        "Configures the state of the username definition as it relates to the device operational configuration. When set to I(present), the username(s) should be configured in the device active configuration and when set to I(absent) the username(s) should not be in the device active configuration"
                    ]
                },
                "update_password": {
                    "choices": [
                        "on_create",
                        "always"
                    ],
                    "default": "always",
                    "description": [
                        "Since passwords are encrypted in the device running config, this argument will instruct the module when to change the password.  When set to C(always), the password will always be updated in the device and when set to C(on_create) the password will be updated only if the username is created."
                    ]
                }
            },
            "short_description": "Manage the aggregate of local users on network device"
        },
        "examples": "\n- name: create a new user\n  net_user:\n    name: ansible\n    sshkey: \"{{ lookup('file', '~/.ssh/id_rsa.pub') }}\"\n    state: present\n\n- name: remove all users except admin\n  net_user:\n    purge: yes\n\n- name: set multiple users to privilege level 15\n  net_user:\n    aggregate:\n      - { name: netop }\n      - { name: netend }\n    privilege: 15\n    state: present\n\n- name: Change Password for User netop\n  net_user:\n    name: netop\n    configured_password: \"{{ new_password }}\"\n    update_password: always\n    state: present\n",
        "metadata": {
            "metadata_version": "1.1",
            "status": [
                "deprecated"
            ],
            "supported_by": "network"
        },
        "return": {
            "commands": {
                "description": "The list of configuration mode commands to send to the device",
                "returned": "always",
                "sample": [
                    "username ansible secret password",
                    "username admin secret admin"
                ],
                "type": "list"
            }
        }
    }
}
