{
    "azure.azcollection.azure_rm_networkinterface": {
        "doc": {
            "author": [
                "Chris Houseknecht (@chouseknecht)",
                "Matt Davis (@nitzmahone)",
                "Yuwei Zhou (@yuwzho)"
            ],
            "collection": "azure.azcollection",
            "description": [
                "Create, update or delete a network interface.",
                "When creating a network interface you must provide the name of an existing virtual network, the name of an existing subnet within the virtual network.",
                "A default security group and public IP address will be created automatically.",
                "Or you can provide the name of an existing security group and public IP address.",
                "See the examples below for more details."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/azure/azcollection/plugins/modules/azure_rm_networkinterface.py",
            "has_action": false,
            "module": "azure_rm_networkinterface",
            "notes": [
                "For authentication with Azure you can pass parameters, set environment variables, use a profile stored in ~/.azure/credentials, or log in before you run your tasks or playbook with C(az login).",
                "Authentication is also possible using a service principal or Active Directory user.",
                "To authenticate via service principal, pass subscription_id, client_id, secret and tenant or set environment variables AZURE_SUBSCRIPTION_ID, AZURE_CLIENT_ID, AZURE_SECRET and AZURE_TENANT.",
                "To authenticate via Active Directory user, pass ad_user and password, or set AZURE_AD_USER and AZURE_PASSWORD in the environment.",
                "Alternatively, credentials can be stored in ~/.azure/credentials. This is an ini file containing a [default] section and the following keys: subscription_id, client_id, secret and tenant or subscription_id, ad_user and password. It is also possible to add additional profiles. Specify the profile by passing profile or setting AZURE_PROFILE in the environment."
            ],
            "options": {
                "ad_user": {
                    "description": [
                        "Active Directory username. Use when authenticating with an Active Directory user rather than service principal."
                    ],
                    "type": "str"
                },
                "adfs_authority_url": {
                    "description": [
                        "Azure AD authority url. Use when authenticating with Username/password, and has your own ADFS authority."
                    ],
                    "type": "str",
                    "version_added": "0.0.1",
                    "version_added_collection": "azure.azcollection"
                },
                "api_profile": {
                    "default": "latest",
                    "description": [
                        "Selects an API profile to use when communicating with Azure services. Default value of C(latest) is appropriate for public clouds; future values will allow use with Azure Stack."
                    ],
                    "type": "str",
                    "version_added": "0.0.1",
                    "version_added_collection": "azure.azcollection"
                },
                "append_tags": {
                    "default": true,
                    "description": [
                        "Use to control if tags field is canonical or just appends to existing tags.",
                        "When canonical, any tags not found in the tags parameter will be removed from the object's metadata."
                    ],
                    "type": "bool"
                },
                "auth_source": {
                    "choices": [
                        "auto",
                        "cli",
                        "credential_file",
                        "env",
                        "msi"
                    ],
                    "default": "auto",
                    "description": [
                        "Controls the source of the credentials to use for authentication.",
                        "Can also be set via the C(ANSIBLE_AZURE_AUTH_SOURCE) environment variable.",
                        "When set to C(auto) (the default) the precedence is module parameters -> C(env) -> C(credential_file) -> C(cli).",
                        "When set to C(env), the credentials will be read from the environment variables",
                        "When set to C(credential_file), it will read the profile from C(~/.azure/credentials).",
                        "When set to C(cli), the credentials will be sources from the Azure CLI profile. C(subscription_id) or the environment variable C(AZURE_SUBSCRIPTION_ID) can be used to identify the subscription ID if more than one is present otherwise the default az cli subscription is used.",
                        "When set to C(msi), the host machine must be an azure resource with an enabled MSI extension. C(subscription_id) or the environment variable C(AZURE_SUBSCRIPTION_ID) can be used to identify the subscription ID if the resource is granted access to more than one subscription, otherwise the first subscription is chosen.",
                        "The C(msi) was added in Ansible 2.6."
                    ],
                    "type": "str",
                    "version_added": "0.0.1",
                    "version_added_collection": "azure.azcollection"
                },
                "cert_validation_mode": {
                    "choices": [
                        "ignore",
                        "validate"
                    ],
                    "description": [
                        "Controls the certificate validation behavior for Azure endpoints. By default, all modules will validate the server certificate, but when an HTTPS proxy is in use, or against Azure Stack, it may be necessary to disable this behavior by passing C(ignore). Can also be set via credential file profile or the C(AZURE_CERT_VALIDATION) environment variable."
                    ],
                    "type": "str",
                    "version_added": "0.0.1",
                    "version_added_collection": "azure.azcollection"
                },
                "client_id": {
                    "description": [
                        "Azure client ID. Use when authenticating with a Service Principal."
                    ],
                    "type": "str"
                },
                "cloud_environment": {
                    "default": "AzureCloud",
                    "description": [
                        "For cloud environments other than the US public cloud, the environment name (as defined by Azure Python SDK, eg, C(AzureChinaCloud), C(AzureUSGovernment)), or a metadata discovery endpoint URL (required for Azure Stack). Can also be set via credential file profile or the C(AZURE_CLOUD_ENVIRONMENT) environment variable."
                    ],
                    "type": "str",
                    "version_added": "0.0.1",
                    "version_added_collection": "azure.azcollection"
                },
                "create_with_security_group": {
                    "default": true,
                    "description": [
                        "Whether a security group should be be created with the NIC.",
                        "If this flag set to C(True) and no I(security_group) set, a default security group will be created."
                    ],
                    "type": "bool"
                },
                "dns_servers": {
                    "description": [
                        "Which DNS servers should the NIC lookup.",
                        "List of IP addresses."
                    ],
                    "type": "list"
                },
                "enable_accelerated_networking": {
                    "default": false,
                    "description": [
                        "Whether the network interface should be created with the accelerated networking feature or not."
                    ],
                    "type": "bool"
                },
                "enable_ip_forwarding": {
                    "aliases": [
                        "ip_forwarding"
                    ],
                    "default": false,
                    "description": [
                        "Whether to enable IP forwarding."
                    ],
                    "type": "bool"
                },
                "ip_configurations": {
                    "description": [
                        "List of IP configurations. Each configuration object should include field I(private_ip_address), I(private_ip_allocation_method), I(public_ip_address_name), I(public_ip), I(public_ip_allocation_method), I(name)."
                    ],
                    "suboptions": {
                        "application_security_groups": {
                            "description": [
                                "List of application security groups in which the IP configuration is included.",
                                "Element of the list could be a resource id of application security group, or dict of I(resource_group) and I(name)."
                            ]
                        },
                        "load_balancer_backend_address_pools": {
                            "description": [
                                "List of existing load-balancer backend address pools to associate with the network interface.",
                                "Can be written as a resource ID.",
                                "Also can be a dict of I(name) and I(load_balancer)."
                            ]
                        },
                        "name": {
                            "description": [
                                "Name of the IP configuration."
                            ],
                            "required": true
                        },
                        "primary": {
                            "default": false,
                            "description": [
                                "Whether the IP configuration is the primary one in the list.",
                                "The first IP configuration default set to I(primary=True)."
                            ],
                            "type": "bool"
                        },
                        "private_ip_address": {
                            "description": [
                                "Private IP address for the IP configuration."
                            ]
                        },
                        "private_ip_allocation_method": {
                            "choices": [
                                "Dynamic",
                                "Static"
                            ],
                            "default": "Dynamic",
                            "description": [
                                "Private IP allocation method."
                            ]
                        },
                        "public_ip_address_name": {
                            "aliases": [
                                "public_ip_address",
                                "public_ip_name"
                            ],
                            "description": [
                                "Name of the public IP address. None for disable IP address."
                            ]
                        },
                        "public_ip_allocation_method": {
                            "choices": [
                                "Dynamic",
                                "Static"
                            ],
                            "default": "Dynamic",
                            "description": [
                                "Public IP allocation method."
                            ]
                        }
                    }
                },
                "location": {
                    "description": [
                        "Valid Azure location. Defaults to location of the resource group."
                    ]
                },
                "name": {
                    "description": [
                        "Name of the network interface."
                    ],
                    "required": true
                },
                "open_ports": {
                    "description": [
                        "When a default security group is created for a Linux host a rule will be added allowing inbound TCP connections to the default SSH port C(22), and for a Windows host rules will be added allowing inbound access to RDP ports C(3389) and C(5986). Override the default ports by providing a list of open ports."
                    ]
                },
                "os_type": {
                    "choices": [
                        "Windows",
                        "Linux"
                    ],
                    "default": "Linux",
                    "description": [
                        "Determines any rules to be added to a default security group.",
                        "When creating a network interface, if no security group name is provided, a default security group will be created.",
                        "If the I(os_type=Windows), a rule allowing RDP access will be added.",
                        "If the I(os_type=Linux), a rule allowing SSH access will be added."
                    ]
                },
                "password": {
                    "description": [
                        "Active Directory user password. Use when authenticating with an Active Directory user rather than service principal."
                    ],
                    "type": "str"
                },
                "private_ip_address": {
                    "description": [
                        "(Deprecate) Valid IPv4 address that falls within the specified subnet.",
                        "This option will be deprecated in 2.9, use I(ip_configurations) instead."
                    ]
                },
                "private_ip_allocation_method": {
                    "choices": [
                        "Dynamic",
                        "Static"
                    ],
                    "default": "Dynamic",
                    "description": [
                        "(Deprecate) Whether or not the assigned IP address is permanent.",
                        "When creating a network interface, if you specify I(private_ip_address=Static), you must provide a value for I(private_ip_address).",
                        "You can update the allocation method to C(Static) after a dynamic private IP address has been assigned.",
                        "This option will be deprecated in 2.9, use I(ip_configurations) instead."
                    ]
                },
                "profile": {
                    "description": [
                        "Security profile found in ~/.azure/credentials file."
                    ],
                    "type": "str"
                },
                "public_ip": {
                    "default": "yes",
                    "description": [
                        "(Deprecate) When creating a network interface, if no public IP address name is provided a default public IP address will be created.",
                        "Set to C(false) if you do not want a public IP address automatically created.",
                        "This option will be deprecated in 2.9, use I(ip_configurations) instead."
                    ],
                    "type": "bool"
                },
                "public_ip_address_name": {
                    "aliases": [
                        "public_ip_address",
                        "public_ip_name"
                    ],
                    "description": [
                        "(Deprecate) Name of an existing public IP address object to associate with the security group.",
                        "This option will be deprecated in 2.9, use I(ip_configurations) instead."
                    ]
                },
                "public_ip_allocation_method": {
                    "choices": [
                        "Dynamic",
                        "Static"
                    ],
                    "default": "Dynamic",
                    "description": [
                        "(Deprecate) If a I(public_ip_address_name) is not provided, a default public IP address will be created.",
                        "The allocation method determines whether or not the public IP address assigned to the network interface is permanent.",
                        "This option will be deprecated in 2.9, use I(ip_configurations) instead."
                    ]
                },
                "resource_group": {
                    "description": [
                        "Name of a resource group where the network interface exists or will be created."
                    ],
                    "required": true
                },
                "secret": {
                    "description": [
                        "Azure client secret. Use when authenticating with a Service Principal."
                    ],
                    "type": "str"
                },
                "security_group": {
                    "aliases": [
                        "security_group_name"
                    ],
                    "description": [
                        "An existing security group with which to associate the network interface.",
                        "If not provided, a default security group will be created when I(create_with_security_group=true).",
                        "It can be the name of security group.",
                        "Make sure the security group is in the same resource group when you only give its name.",
                        "It can be the resource id.",
                        "It can be a dict contains security_group's I(name) and I(resource_group)."
                    ]
                },
                "state": {
                    "choices": [
                        "absent",
                        "present"
                    ],
                    "default": "present",
                    "description": [
                        "Assert the state of the network interface. Use C(present) to create or update an interface and C(absent) to delete an interface."
                    ]
                },
                "subnet_name": {
                    "aliases": [
                        "subnet"
                    ],
                    "description": [
                        "Name of an existing subnet within the specified virtual network. Required when creating a network interface.",
                        "Use the C(virtual_network)'s resource group."
                    ],
                    "required": true
                },
                "subscription_id": {
                    "description": [
                        "Your Azure subscription Id."
                    ],
                    "type": "str"
                },
                "tags": {
                    "description": [
                        "Dictionary of string:string pairs to assign as metadata to the object.",
                        "Metadata tags on the object will be updated with any provided values.",
                        "To remove tags set append_tags option to false.",
                        "Currently, Azure DNS zones and Traffic Manager services also don't allow the use of spaces in the tag.",
                        "Azure Front Door doesn't support the use of",
                        "Azure Automation and Azure CDN only support 15 tags on resources."
                    ],
                    "type": "dict"
                },
                "tenant": {
                    "description": [
                        "Azure tenant ID. Use when authenticating with a Service Principal."
                    ],
                    "type": "str"
                },
                "virtual_network": {
                    "aliases": [
                        "virtual_network_name"
                    ],
                    "description": [
                        "An existing virtual network with which the network interface will be associated. Required when creating a network interface.",
                        "It can be the virtual network's name.",
                        "Make sure your virtual network is in the same resource group as NIC when you give only the name.",
                        "It can be the virtual network's resource id.",
                        "It can be a dict which contains I(name) and I(resource_group) of the virtual network."
                    ],
                    "required": true
                }
            },
            "requirements": [
                "python >= 2.7",
                "azure >= 2.0.0"
            ],
            "seealso": [
                {
                    "description": "How to authenticate using the C(az login) command.",
                    "link": "https://docs.microsoft.com/en-us/cli/azure/authenticate-azure-cli?view=azure-cli-latest",
                    "name": "Sign in with Azure CLI"
                }
            ],
            "short_description": "Manage Azure network interfaces",
            "version_added": "0.1.0",
            "version_added_collection": "azure.azcollection"
        },
        "examples": "\n    - name: Create a network interface with minimal parameters\n      azure_rm_networkinterface:\n        name: nic001\n        resource_group: myResourceGroup\n        virtual_network: vnet001\n        subnet_name: subnet001\n        ip_configurations:\n          - name: ipconfig1\n            public_ip_address_name: publicip001\n            primary: True\n\n    - name: Create a network interface with private IP address only (no Public IP)\n      azure_rm_networkinterface:\n        name: nic001\n        resource_group: myResourceGroup\n        virtual_network: vnet001\n        subnet_name: subnet001\n        create_with_security_group: False\n        ip_configurations:\n          - name: ipconfig1\n            primary: True\n\n    - name: Create a network interface for use in a Windows host (opens RDP port) with custom RDP port\n      azure_rm_networkinterface:\n        name: nic002\n        resource_group: myResourceGroup\n        virtual_network: vnet001\n        subnet_name: subnet001\n        os_type: Windows\n        rdp_port: 3399\n        security_group: \"/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroup/myResourceGroup/providers/Microsoft.Network/networkSecurit\n                         yGroups/nsg001\"\n        ip_configurations:\n          - name: ipconfig1\n            public_ip_address_name: publicip001\n            primary: True\n\n    - name: Create a network interface using existing security group and public IP\n      azure_rm_networkinterface:\n        name: nic003\n        resource_group: myResourceGroup\n        virtual_network: vnet001\n        subnet_name: subnet001\n        security_group: secgroup001\n        ip_configurations:\n          - name: ipconfig1\n            public_ip_address_name: publicip001\n            primary: True\n\n    - name: Create a network with multiple ip configurations\n      azure_rm_networkinterface:\n        name: nic004\n        resource_group: myResourceGroup\n        subnet_name: subnet001\n        virtual_network: vnet001\n        security_group:\n          name: testnic002\n          resource_group: Testing1\n        ip_configurations:\n          - name: ipconfig1\n            public_ip_address_name: publicip001\n            primary: True\n          - name: ipconfig2\n            load_balancer_backend_address_pools:\n              - \"{{ loadbalancer001.state.backend_address_pools[0].id }}\"\n              - name: backendaddrpool1\n                load_balancer: loadbalancer001\n\n    - name: Create a network interface in accelerated networking mode\n      azure_rm_networkinterface:\n        name: nic005\n        resource_group: myResourceGroup\n        virtual_network_name: vnet001\n        subnet_name: subnet001\n        enable_accelerated_networking: True\n\n    - name: Create a network interface with IP forwarding\n      azure_rm_networkinterface:\n        name: nic001\n        resource_group: myResourceGroup\n        virtual_network: vnet001\n        subnet_name: subnet001\n        ip_forwarding: True\n        ip_configurations:\n          - name: ipconfig1\n            public_ip_address_name: publicip001\n            primary: True\n\n    - name: Create a network interface with dns servers\n      azure_rm_networkinterface:\n        name: nic009\n        resource_group: myResourceGroup\n        virtual_network: vnet001\n        subnet_name: subnet001\n        dns_servers:\n          - 8.8.8.8\n\n    - name: Delete network interface\n      azure_rm_networkinterface:\n        resource_group: myResourceGroup\n        name: nic003\n        state: absent\n",
        "metadata": null,
        "return": {
            "state": {
                "contains": {
                    "dns_server": {
                        "description": [
                            "Which DNS servers should the NIC lookup.",
                            "List of IP addresses."
                        ],
                        "sample": [
                            "8.9.10.11",
                            "7.8.9.10"
                        ],
                        "type": "list"
                    },
                    "dns_setting": {
                        "description": [
                            "The DNS settings in network interface."
                        ],
                        "sample": {
                            "applied_dns_servers": [],
                            "dns_servers": [
                                "8.9.10.11",
                                "7.8.9.10"
                            ],
                            "internal_dns_name_label": null,
                            "internal_fqdn": null
                        },
                        "type": "dict"
                    },
                    "enable_accelerated_networking": {
                        "description": [
                            "Whether the network interface should be created with the accelerated networking feature or not."
                        ],
                        "sample": true,
                        "type": "bool"
                    },
                    "enable_ip_forwarding": {
                        "description": "Whether to enable IP forwarding.",
                        "sample": true,
                        "type": "bool"
                    },
                    "etag": {
                        "description": [
                            "A unique read-only string that changes whenever the resource is updated."
                        ],
                        "sample": "W/\"be115a43-2148-4545-a324-f33ad444c926\"",
                        "type": "str"
                    },
                    "id": {
                        "description": [
                            "Id of the network interface."
                        ],
                        "sample": "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroup/myResourceGroup/providers/Microsoft.Network/networkInterfaces/nic003",
                        "type": "str"
                    },
                    "ip_configurations": {
                        "contains": {
                            "load_balancer_backend_address_pools": {
                                "description": [
                                    "List of existing load-balancer backend address pools to associate with the network interface."
                                ],
                                "type": "list"
                            },
                            "name": {
                                "description": [
                                    "Name of the IP configuration."
                                ],
                                "sample": "default",
                                "type": "str"
                            },
                            "private_ip_address": {
                                "description": [
                                    "Private IP address for the IP configuration."
                                ],
                                "sample": "10.1.0.10",
                                "type": "str"
                            },
                            "private_ip_allocation_method": {
                                "description": [
                                    "Private IP allocation method."
                                ],
                                "sample": "Static",
                                "type": "str"
                            },
                            "public_ip_address": {
                                "description": [
                                    "Name of the public IP address. None for disable IP address."
                                ],
                                "sample": {
                                    "id": "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroup/myResourceGroup/providers/Microsoft.Network/publicIPAddresse s/publicip001",
                                    "name": "publicip001"
                                },
                                "type": "dict"
                            },
                            "subnet": {
                                "description": [
                                    "The reference of the subnet resource."
                                ],
                                "sample": {
                                    "id": "/subscriptions/xxxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/ myresourcegroup/providers/Microsoft.Network/virtualNetworks/tnb57dc95318/subnets/tnb57dc95318",
                                    "name": "tnb57dc95318",
                                    "resource_group": "myresourcegroup",
                                    "virtual_network_name": "tnb57dc95318"
                                },
                                "type": "dict"
                            }
                        },
                        "description": [
                            "List of IP configurations."
                        ],
                        "type": "complex"
                    },
                    "location": {
                        "description": [
                            "The network interface resource location."
                        ],
                        "sample": "eastus",
                        "type": "str"
                    },
                    "mac_address": {
                        "description": [
                            "The MAC address of the network interface."
                        ],
                        "type": "str"
                    },
                    "name": {
                        "description": [
                            "Name of the network interface."
                        ],
                        "sample": "nic003",
                        "type": "str"
                    },
                    "network_security_group": {
                        "description": [
                            "The reference of the network security group resource."
                        ],
                        "sample": {
                            "id": "/subscriptions//xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroup/ myResourceGroup/providers/Microsoft.Network/networkSecurityGroups/nsg001",
                            "name": "nsg001"
                        },
                        "type": "dict"
                    },
                    "primary": {
                        "description": [
                            "Get whether this is a primary network interface on virtual machine."
                        ],
                        "sample": true,
                        "type": "bool"
                    },
                    "provisioning_state": {
                        "description": [
                            "The provisioning state of the public IP resource."
                        ],
                        "sample": "Succeeded",
                        "type": "str"
                    },
                    "tags": {
                        "description": "-Tags of the network interface.",
                        "sample": {
                            "key": "value"
                        },
                        "type": "dict"
                    },
                    "type": {
                        "description": [
                            "Type of the resource."
                        ],
                        "sample": "Microsoft.Network/networkInterfaces",
                        "type": "str"
                    }
                },
                "description": [
                    "The current state of the network interface."
                ],
                "returned": "always",
                "type": "complex"
            }
        }
    }
}
