{
    "cisco.nxos.nxos_vxlan_vtep": {
        "doc": {
            "author": "Gabriele Gerbino (@GGabriele)",
            "collection": "cisco.nxos",
            "description": [
                "Manages VXLAN Network Virtualization Endpoint (NVE) overlay interface that terminates VXLAN tunnels."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/cisco/nxos/plugins/modules/nxos_vxlan_vtep.py",
            "has_action": true,
            "module": "nxos_vxlan_vtep",
            "notes": [
                "Tested against NXOSv 7.3.(0)D1(1) on VIRL",
                "The module is used to manage NVE properties, not to create NVE interfaces. Use M(cisco.nxos.nxos_interface) if you wish to do so.",
                "C(state=absent) removes the interface.",
                "Default, where supported, restores params default value.",
                "For information on using CLI and NX-API see the :ref:`NXOS Platform Options guide <nxos_platform_options>`",
                "For more information on using Ansible to manage network devices see the :ref:`Ansible Network Guide <network_guide>`",
                "For more information on using Ansible to manage Cisco devices see the `Cisco integration page <https://www.ansible.com/integrations/networks/cisco>`_."
            ],
            "options": {
                "description": {
                    "description": [
                        "Description of the NVE interface."
                    ],
                    "type": "str"
                },
                "global_ingress_replication_bgp": {
                    "description": [
                        "Configures ingress replication protocol as bgp for all VNIs. This is available on Nexus 9000 series switches running NX-OS software release 9.2(x) or higher."
                    ],
                    "type": "bool"
                },
                "global_mcast_group_L2": {
                    "description": [
                        "Global multicast IP prefix for L2 VNIs or the keyword 'default'. This is available on Nexus 9000 series switches running NX-OS software release 9.2(x) or higher."
                    ],
                    "type": "str"
                },
                "global_mcast_group_L3": {
                    "description": [
                        "Global multicast IP prefix for L3 VNIs or the keyword 'default'. This is available on Nexus 9000 series switches running NX-OS software release 9.2(x) or higher."
                    ],
                    "type": "str"
                },
                "global_suppress_arp": {
                    "description": [
                        "Enables ARP suppression for all VNIs. This is available on NX-OS 9K series running 9.2.x or higher."
                    ],
                    "type": "bool"
                },
                "host_reachability": {
                    "description": [
                        "Specify mechanism for host reachability advertisement.  A Boolean value of 'true' indicates that BGP will be used for host reachability advertisement. A Boolean value of 'false' indicates that no protocol is used for host reachability advertisement. Other host reachability advertisement protocols (e.g. OpenFlow, controller, etc.) are not supported."
                    ],
                    "type": "bool"
                },
                "interface": {
                    "description": [
                        "Interface name for the VXLAN Network Virtualization Endpoint."
                    ],
                    "required": true,
                    "type": "str"
                },
                "multisite_border_gateway_interface": {
                    "description": [
                        "Specify the loopback interface whose IP address should be used for the NVE Multisite Border-gateway Interface. This is available on specific Nexus 9000 series switches running NX-OS 7.0(3)I7(x) or higher. Specify \"default\" to remove an existing gateway config."
                    ],
                    "type": "str",
                    "version_added": "1.1.0",
                    "version_added_collection": "cisco.nxos"
                },
                "provider": {
                    "description": [
                        "B(Deprecated)",
                        "Starting with Ansible 2.5 we recommend using C(connection: network_cli).",
                        "Starting with Ansible 2.6 we recommend using C(connection: httpapi) for NX-API.",
                        "This option will be removed in a release after 2022-06-01.",
                        "For more information please see the L(NXOS Platform Options guide, ../network/user_guide/platform_nxos.html).",
                        "HORIZONTALLINE",
                        "A dict object containing connection details."
                    ],
                    "suboptions": {
                        "auth_pass": {
                            "description": [
                                "Specifies the password to use if required to enter privileged mode on the remote device.  If I(authorize) is false, then this argument does nothing. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_AUTH_PASS) will be used instead."
                            ],
                            "type": "str"
                        },
                        "authorize": {
                            "default": false,
                            "description": [
                                "Instructs the module to enter privileged mode on the remote device before sending any commands.  If not specified, the device will attempt to execute all commands in non-privileged mode. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_AUTHORIZE) will be used instead."
                            ],
                            "type": "bool"
                        },
                        "host": {
                            "description": [
                                "Specifies the DNS host name or address for connecting to the remote device over the specified transport.  The value of host is used as the destination address for the transport."
                            ],
                            "type": "str"
                        },
                        "password": {
                            "description": [
                                "Specifies the password to use to authenticate the connection to the remote device.  This is a common argument used for either I(cli) or I(nxapi) transports. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_PASSWORD) will be used instead."
                            ],
                            "type": "str"
                        },
                        "port": {
                            "description": [
                                "Specifies the port to use when building the connection to the remote device.  This value applies to either I(cli) or I(nxapi).  The port value will default to the appropriate transport common port if none is provided in the task.  (cli=22, http=80, https=443)."
                            ],
                            "type": "int"
                        },
                        "ssh_keyfile": {
                            "description": [
                                "Specifies the SSH key to use to authenticate the connection to the remote device.  This argument is only used for the I(cli) transport. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_SSH_KEYFILE) will be used instead."
                            ],
                            "type": "str"
                        },
                        "timeout": {
                            "description": [
                                "Specifies the timeout in seconds for communicating with the network device for either connecting or sending commands.  If the timeout is exceeded before the operation is completed, the module will error. NX-API can be slow to return on long-running commands (sh mac, sh bgp, etc)."
                            ],
                            "type": "int"
                        },
                        "transport": {
                            "choices": [
                                "cli",
                                "nxapi"
                            ],
                            "default": "cli",
                            "description": [
                                "Configures the transport connection to use when connecting to the remote device.  The transport argument supports connectivity to the device over cli (ssh) or nxapi."
                            ],
                            "type": "str"
                        },
                        "use_proxy": {
                            "default": true,
                            "description": [
                                "If C(no), the environment variables C(http_proxy) and C(https_proxy) will be ignored."
                            ],
                            "type": "bool"
                        },
                        "use_ssl": {
                            "default": false,
                            "description": [
                                "Configures the I(transport) to use SSL if set to C(yes) only when the C(transport=nxapi), otherwise this value is ignored."
                            ],
                            "type": "bool"
                        },
                        "username": {
                            "description": [
                                "Configures the username to use to authenticate the connection to the remote device.  This value is used to authenticate either the CLI login or the nxapi authentication depending on which transport is used. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_USERNAME) will be used instead."
                            ],
                            "type": "str"
                        },
                        "validate_certs": {
                            "default": false,
                            "description": [
                                "If C(no), SSL certificates will not be validated. This should only be used on personally controlled sites using self-signed certificates.  If the transport argument is not nxapi, this value is ignored."
                            ],
                            "type": "bool"
                        }
                    },
                    "type": "dict"
                },
                "shutdown": {
                    "description": [
                        "Administratively shutdown the NVE interface."
                    ],
                    "type": "bool"
                },
                "source_interface": {
                    "description": [
                        "Specify the loopback interface whose IP address should be used for the NVE interface."
                    ],
                    "type": "str"
                },
                "source_interface_hold_down_time": {
                    "description": [
                        "Suppresses advertisement of the NVE loopback address until the overlay has converged."
                    ],
                    "type": "str"
                },
                "state": {
                    "choices": [
                        "present",
                        "absent"
                    ],
                    "default": "present",
                    "description": [
                        "Determines whether the config should be present or not on the device."
                    ],
                    "type": "str"
                }
            },
            "short_description": "Manages VXLAN Network Virtualization Endpoint (NVE).",
            "version_added": "1.0.0",
            "version_added_collection": "cisco.nxos"
        },
        "examples": "\n- cisco.nxos.nxos_vxlan_vtep:\n    interface: nve1\n    description: default\n    host_reachability: true\n    source_interface: Loopback0\n    source_interface_hold_down_time: 30\n    shutdown: default\n    multisite_border_gateway_interface: Loopback0\n",
        "metadata": null,
        "return": {
            "commands": {
                "description": "commands sent to the device",
                "returned": "always",
                "sample": [
                    "interface nve1",
                    "source-interface loopback0",
                    "source-interface hold-down-time 30",
                    "description simple description",
                    "shutdown",
                    "host-reachability protocol bgp",
                    "multisite border-gateway interface loopback0"
                ],
                "type": "list"
            }
        }
    }
}
