{
    "cisco.asa.asa_config": {
        "doc": {
            "author": "Peter Sprygada (@privateip), Patrick Ogenstad (@ogenstad)",
            "collection": "cisco.asa",
            "description": [
                "Cisco ASA configurations use a simple block indent file syntax for segmenting configuration into sections.  This module provides an implementation for working with ASA configuration sections in a deterministic way."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/cisco/asa/plugins/modules/asa_config.py",
            "has_action": true,
            "module": "asa_config",
            "notes": [
                "For more information on using Ansible to manage network devices see the :ref:`Ansible Network Guide <network_guide>`"
            ],
            "options": {
                "after": {
                    "description": [
                        "The ordered set of commands to append to the end of the command stack if a change needs to be made.  Just like with I(before) this allows the playbook designer to append a set of commands to be executed after the command set."
                    ],
                    "elements": "str",
                    "type": "list"
                },
                "authorize": {
                    "default": false,
                    "description": [
                        "B(Deprecated)",
                        "Starting with Ansible 2.5 we recommend using C(connection: network_cli) and C(become: yes).",
                        "For more information please see the L(Network Guide, ../network/getting_started/network_differences.html#multiple-communication-protocols).",
                        "HORIZONTALLINE",
                        "Instructs the module to enter privileged mode on the remote device before sending any commands.  If not specified, the device will attempt to execute all commands in non-privileged mode. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_AUTHORIZE) will be used instead."
                    ],
                    "type": "bool"
                },
                "backup": {
                    "default": false,
                    "description": [
                        "This argument will cause the module to create a full backup of the current C(running-config) from the remote device before any changes are made. If the C(backup_options) value is not given, the backup file is written to the C(backup) folder in the playbook root directory. If the directory does not exist, it is created."
                    ],
                    "type": "bool"
                },
                "backup_options": {
                    "description": [
                        "This is a dict object containing configurable options related to backup file path. The value of this option is read only when C(backup) is set to I(yes), if C(backup) is set to I(no) this option will be silently ignored."
                    ],
                    "suboptions": {
                        "dir_path": {
                            "description": [
                                "This option provides the path ending with directory name in which the backup configuration file will be stored. If the directory does not exist it will be first created and the filename is either the value of C(filename) or default filename as described in C(filename) options description. If the path value is not given in that case a I(backup) directory will be created in the current working directory and backup configuration will be copied in C(filename) within I(backup) directory."
                            ],
                            "type": "path"
                        },
                        "filename": {
                            "description": [
                                "The filename to be used to store the backup configuration. If the filename is not given it will be generated based on the hostname, current time and date in format defined by <hostname>_config.<current-date>@<current-time>"
                            ],
                            "type": "str"
                        }
                    },
                    "type": "dict"
                },
                "before": {
                    "description": [
                        "The ordered set of commands to push on to the command stack if a change needs to be made.  This allows the playbook designer the opportunity to perform configuration commands prior to pushing any changes without affecting how the set of commands are matched against the system."
                    ],
                    "elements": "str",
                    "type": "list"
                },
                "config": {
                    "description": [
                        "The C(config) argument allows the playbook designer to supply the base configuration to be used to validate configuration changes necessary.  If this argument is provided, the module will not download the running-config from the remote node."
                    ],
                    "type": "str"
                },
                "context": {
                    "description": [
                        "Specifies which context to target if you are running in the ASA in multiple context mode. Defaults to the current context you login to."
                    ],
                    "type": "str"
                },
                "defaults": {
                    "default": false,
                    "description": [
                        "This argument specifies whether or not to collect all defaults when getting the remote device running config.  When enabled, the module will get the current config by issuing the command C(show running-config all)."
                    ],
                    "type": "bool"
                },
                "lines": {
                    "aliases": [
                        "commands"
                    ],
                    "description": [
                        "The ordered set of commands that should be configured in the section.  The commands must be the exact same commands as found in the device running-config.  Be sure to note the configuration command syntax as some commands are automatically modified by the device config parser."
                    ],
                    "elements": "str",
                    "type": "list"
                },
                "match": {
                    "choices": [
                        "line",
                        "strict",
                        "exact",
                        "none"
                    ],
                    "default": "line",
                    "description": [
                        "Instructs the module on the way to perform the matching of the set of commands against the current device config.  If match is set to I(line), commands are matched line by line.  If match is set to I(strict), command lines are matched with respect to position.  If match is set to I(exact), command lines must be an equal match.  Finally, if match is set to I(none), the module will not attempt to compare the source configuration with the running configuration on the remote device."
                    ],
                    "type": "str"
                },
                "parents": {
                    "description": [
                        "The ordered set of parents that uniquely identify the section or hierarchy the commands should be checked against.  If the parents argument is omitted, the commands are checked against the set of top level or global commands."
                    ],
                    "elements": "str",
                    "type": "list"
                },
                "passwords": {
                    "default": false,
                    "description": [
                        "This argument specifies to include passwords in the config when retrieving the running-config from the remote device.  This includes passwords related to VPN endpoints.  This argument is mutually exclusive with I(defaults)."
                    ],
                    "type": "bool"
                },
                "provider": {
                    "description": [
                        "B(Deprecated)",
                        "Starting with Ansible 2.5 we recommend using C(connection: network_cli).",
                        "For more information please see the L(Network Guide, ../network/getting_started/network_differences.html#multiple-communication-protocols).",
                        "HORIZONTALLINE",
                        "A dict object containing connection details."
                    ],
                    "suboptions": {
                        "auth_pass": {
                            "description": [
                                "Specifies the password to use if required to enter privileged mode on the remote device.  If I(authorize) is false, then this argument does nothing. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_AUTH_PASS) will be used instead."
                            ],
                            "type": "str"
                        },
                        "authorize": {
                            "default": false,
                            "description": [
                                "Instructs the module to enter privileged mode on the remote device before sending any commands.  If not specified, the device will attempt to execute all commands in non-privileged mode. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_AUTHORIZE) will be used instead."
                            ],
                            "type": "bool"
                        },
                        "host": {
                            "description": [
                                "Specifies the DNS host name or address for connecting to the remote device over the specified transport.  The value of host is used as the destination address for the transport."
                            ],
                            "type": "str"
                        },
                        "password": {
                            "description": [
                                "Specifies the password to use to authenticate the connection to the remote device.   This value is used to authenticate the SSH session. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_PASSWORD) will be used instead."
                            ],
                            "type": "str"
                        },
                        "port": {
                            "description": [
                                "Specifies the port to use when building the connection to the remote device."
                            ],
                            "type": "int"
                        },
                        "ssh_keyfile": {
                            "description": [
                                "Specifies the SSH key to use to authenticate the connection to the remote device.   This value is the path to the key used to authenticate the SSH session. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_SSH_KEYFILE) will be used instead."
                            ],
                            "type": "path"
                        },
                        "timeout": {
                            "description": [
                                "Specifies idle timeout in seconds for the connection, in seconds. Useful if the console freezes before continuing. For example when saving configurations."
                            ],
                            "type": "int"
                        },
                        "username": {
                            "description": [
                                "Configures the username to use to authenticate the connection to the remote device.  This value is used to authenticate the SSH session. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_USERNAME) will be used instead."
                            ],
                            "type": "str"
                        }
                    },
                    "type": "dict"
                },
                "replace": {
                    "choices": [
                        "line",
                        "block"
                    ],
                    "default": "line",
                    "description": [
                        "Instructs the module on the way to perform the configuration on the device.  If the replace argument is set to I(line) then the modified lines are pushed to the device in configuration mode.  If the replace argument is set to I(block) then the entire command block is pushed to the device in configuration mode if any line is not correct"
                    ],
                    "type": "str"
                },
                "save": {
                    "default": false,
                    "description": [
                        "The C(save) argument instructs the module to save the running- config to the startup-config at the conclusion of the module running.  If check mode is specified, this argument is ignored."
                    ],
                    "type": "bool"
                },
                "src": {
                    "description": [
                        "Specifies the source path to the file that contains the configuration or configuration template to load.  The path to the source file can either be the full path on the Ansible control host or a relative path from the playbook or role root directory.  This argument is mutually exclusive with I(lines), I(parents)."
                    ],
                    "type": "path"
                }
            },
            "short_description": "Manage configuration sections on Cisco ASA devices",
            "version_added": "1.0.0",
            "version_added_collection": "cisco.asa"
        },
        "examples": "\n- cisco.asa.asa_config:\n    lines:\n    - network-object host 10.80.30.18\n    - network-object host 10.80.30.19\n    - network-object host 10.80.30.20\n    parents: [object-group network OG-MONITORED-SERVERS]\n    provider: '{{ cli }}'\n\n- cisco.asa.asa_config:\n    host: '{{ inventory_hostname }}'\n    lines:\n    - message-length maximum client auto\n    - message-length maximum 512\n    match: line\n    parents: [policy-map type inspect dns PM-DNS, parameters]\n    authorize: yes\n    auth_pass: cisco\n    username: admin\n    password: cisco\n    context: ansible\n\n- cisco.asa.asa_config:\n    lines:\n    - ikev1 pre-shared-key MyS3cretVPNK3y\n    parents: tunnel-group 1.1.1.1 ipsec-attributes\n    passwords: yes\n    provider: '{{ cli }}'\n\n- name: attach ASA acl on interface vlan13/nameif cloud13\n  cisco.asa.asa_config:\n    lines:\n    - access-group cloud-acl_access_in in interface cloud13\n    provider: '{{ cli }}'\n\n- name: configure ASA (>=9.2) default BGP\n  cisco.asa.asa_config:\n    lines:\n    - bgp log-neighbor-changes\n    - bgp bestpath compare-routerid\n    provider: '{{ cli }}'\n    parents:\n    - router bgp 65002\n  register: bgp\n  when: bgp_default_config is defined\n- name: configure ASA (>=9.2) BGP neighbor in default/single context mode\n  cisco.asa.asa_config:\n    lines:\n    - bgp router-id {{ bgp_router_id }}\n    - neighbor {{ bgp_neighbor_ip }} remote-as {{ bgp_neighbor_as }}\n    - neighbor {{ bgp_neighbor_ip }} description {{ bgp_neighbor_name }}\n    provider: '{{ cli }}'\n    parents:\n    - router bgp 65002\n    - address-family ipv4 unicast\n  register: bgp\n  when: bgp_neighbor_as is defined\n- name: configure ASA interface with standby\n  cisco.asa.asa_config:\n    lines:\n    - description my cloud interface\n    - nameif cloud13\n    - security-level 50\n    - ip address 192.168.13.1 255.255.255.0 standby 192.168.13.2\n    provider: '{{ cli }}'\n    parents: [interface Vlan13]\n  register: interface\n- name: Show changes to interface from task above\n  debug:\n    var: interface\n\n- name: configurable backup path\n  cisco.asa.asa_config:\n    lines:\n    - access-group cloud-acl_access_in in interface cloud13\n    provider: '{{ cli }}'\n    backup: yes\n    backup_options:\n      filename: backup.cfg\n      dir_path: /home/user\n",
        "metadata": null,
        "return": {
            "backup_path": {
                "description": "The full path to the backup file",
                "returned": "when backup is yes",
                "sample": "/playbooks/ansible/backup/asa_config.2016-07-16@22:28:34",
                "type": "str"
            },
            "updates": {
                "description": "The set of commands that will be pushed to the remote device",
                "returned": "always",
                "sample": [
                    "...",
                    "..."
                ],
                "type": "list"
            }
        }
    }
}
