{
    "community.aws.aws_batch_job_definition": {
        "doc": {
            "author": "Jon Meran (@jonmer85)",
            "collection": "community.aws",
            "description": [
                "This module allows the management of AWS Batch Job Definitions.",
                "It is idempotent and supports \"Check\" mode.",
                "Use module M(community.aws.aws_batch_compute_environment) to manage the compute environment, M(community.aws.aws_batch_job_queue) to manage job queues, M(community.aws.aws_batch_job_definition) to manage job definitions."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/aws/plugins/modules/aws_batch_job_definition.py",
            "has_action": false,
            "module": "aws_batch_job_definition",
            "notes": [
                "If parameters are not set within the module, the following environment variables can be used in decreasing order of precedence C(AWS_URL) or C(EC2_URL), C(AWS_ACCESS_KEY_ID) or C(AWS_ACCESS_KEY) or C(EC2_ACCESS_KEY), C(AWS_SECRET_ACCESS_KEY) or C(AWS_SECRET_KEY) or C(EC2_SECRET_KEY), C(AWS_SECURITY_TOKEN) or C(EC2_SECURITY_TOKEN), C(AWS_REGION) or C(EC2_REGION)",
                "Ansible uses the boto configuration file (typically ~/.boto) if no credentials are provided. See https://boto.readthedocs.io/en/latest/boto_config_tut.html",
                "C(AWS_REGION) or C(EC2_REGION) can be typically be used to specify the AWS region, when required, but this can also be configured in the boto config file"
            ],
            "options": {
                "attempts": {
                    "description": [
                        "Retry strategy - The number of times to move a job to the RUNNABLE status. You may specify between 1 and 10 attempts. If attempts is greater than one, the job is retried if it fails until it has moved to RUNNABLE that many times."
                    ],
                    "type": "int"
                },
                "aws_access_key": {
                    "aliases": [
                        "ec2_access_key",
                        "access_key"
                    ],
                    "description": [
                        "AWS access key. If not set then the value of the AWS_ACCESS_KEY_ID, AWS_ACCESS_KEY or EC2_ACCESS_KEY environment variable is used."
                    ],
                    "type": "str"
                },
                "aws_config": {
                    "description": [
                        "A dictionary to modify the botocore configuration.",
                        "Parameters can be found at U(https://botocore.amazonaws.com/v1/documentation/api/latest/reference/config.html#botocore.config.Config).",
                        "Only the 'user_agent' key is used for boto modules. See U(http://boto.cloudhackers.com/en/latest/boto_config_tut.html#boto) for more boto configuration."
                    ],
                    "type": "dict"
                },
                "aws_secret_key": {
                    "aliases": [
                        "ec2_secret_key",
                        "secret_key"
                    ],
                    "description": [
                        "AWS secret key. If not set then the value of the AWS_SECRET_ACCESS_KEY, AWS_SECRET_KEY, or EC2_SECRET_KEY environment variable is used."
                    ],
                    "type": "str"
                },
                "command": {
                    "description": [
                        "The command that is passed to the container. This parameter maps to Cmd in the Create a container section of the Docker Remote API and the COMMAND parameter to docker run. For more information, see U(https://docs.docker.com/engine/reference/builder/#cmd)."
                    ],
                    "elements": "str",
                    "type": "list"
                },
                "debug_botocore_endpoint_logs": {
                    "default": "no",
                    "description": [
                        "Use a botocore.endpoint logger to parse the unique (rather than total) \"resource:action\" API calls made during a task, outputing the set to the resource_actions key in the task results. Use the aws_resource_action callback to output to total list made during a playbook. The ANSIBLE_DEBUG_BOTOCORE_LOGS environment variable may also be used."
                    ],
                    "type": "bool"
                },
                "ec2_url": {
                    "description": [
                        "Url to use to connect to EC2 or your Eucalyptus cloud (by default the module will use EC2 endpoints). Ignored for modules where region is required. Must be specified for all other modules if region is not used. If not set then the value of the EC2_URL environment variable, if any, is used."
                    ],
                    "type": "str"
                },
                "environment": {
                    "description": [
                        "The environment variables to pass to a container. This parameter maps to Env in the Create a container section of the Docker Remote API and the --env option to docker run."
                    ],
                    "elements": "dict",
                    "suboptions": {
                        "name": {
                            "description": [
                                "The name of the key value pair. For environment variables, this is the name of the environment variable."
                            ]
                        },
                        "value": {
                            "description": [
                                "The value of the key value pair. For environment variables, this is the value of the environment variable."
                            ]
                        }
                    },
                    "type": "list"
                },
                "image": {
                    "description": [
                        "The image used to start a container. This string is passed directly to the Docker daemon. Images in the Docker Hub registry are available by default. Other repositories are specified with `` repository-url /image <colon>tag ``. Up to 255 letters (uppercase and lowercase), numbers, hyphens, underscores, colons, periods, forward slashes, and number signs are allowed. This parameter maps to Image in the Create a container section of the Docker Remote API and the IMAGE parameter of docker run."
                    ],
                    "required": true,
                    "type": "str"
                },
                "job_definition_arn": {
                    "description": [
                        "The ARN for the job definition."
                    ],
                    "type": "str"
                },
                "job_definition_name": {
                    "description": [
                        "The name for the job definition."
                    ],
                    "required": true,
                    "type": "str"
                },
                "job_role_arn": {
                    "description": [
                        "The Amazon Resource Name (ARN) of the IAM role that the container can assume for AWS permissions."
                    ],
                    "type": "str"
                },
                "memory": {
                    "description": [
                        "The hard limit (in MiB) of memory to present to the container. If your container attempts to exceed the memory specified here, the container is killed. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run."
                    ],
                    "required": true,
                    "type": "int"
                },
                "mount_points": {
                    "description": [
                        "The mount points for data volumes in your container. This parameter maps to Volumes in the Create a container section of the Docker Remote API and the --volume option to docker run."
                    ],
                    "elements": "dict",
                    "suboptions": {
                        "containerPath": {
                            "description": [
                                "The path on the container at which to mount the host volume."
                            ]
                        },
                        "readOnly": {
                            "description": [
                                "If this value is true , the container has read-only access to the volume; otherwise, the container can write to the volume. The default value is C(false)."
                            ]
                        },
                        "sourceVolume": {
                            "description": [
                                "The name of the volume to mount."
                            ]
                        }
                    },
                    "type": "list"
                },
                "parameters": {
                    "description": [
                        "Default parameter substitution placeholders to set in the job definition. Parameters are specified as a key-value pair mapping. Parameters in a SubmitJob request override any corresponding parameter defaults from the job definition."
                    ],
                    "type": "dict"
                },
                "privileged": {
                    "description": [
                        "When this parameter is true, the container is given elevated privileges on the host container instance (similar to the root user). This parameter maps to Privileged in the Create a container section of the Docker Remote API and the --privileged option to docker run."
                    ],
                    "type": "str"
                },
                "profile": {
                    "description": [
                        "Uses a boto profile. Only works with boto >= 2.24.0."
                    ],
                    "type": "str"
                },
                "readonly_root_filesystem": {
                    "description": [
                        "When this parameter is true, the container is given read-only access to its root file system. This parameter maps to ReadonlyRootfs in the Create a container section of the Docker Remote API and the --read-only option to docker run."
                    ],
                    "type": "str"
                },
                "region": {
                    "aliases": [
                        "aws_region",
                        "ec2_region"
                    ],
                    "description": [
                        "The AWS region to use. If not specified then the value of the AWS_REGION or EC2_REGION environment variable, if any, is used. See U(http://docs.aws.amazon.com/general/latest/gr/rande.html#ec2_region)"
                    ],
                    "type": "str"
                },
                "security_token": {
                    "aliases": [
                        "access_token"
                    ],
                    "description": [
                        "AWS STS security token. If not set then the value of the AWS_SECURITY_TOKEN or EC2_SECURITY_TOKEN environment variable is used."
                    ],
                    "type": "str"
                },
                "state": {
                    "choices": [
                        "present",
                        "absent"
                    ],
                    "default": "present",
                    "description": [
                        "Describes the desired state."
                    ],
                    "type": "str"
                },
                "type": {
                    "description": [
                        "The type of job definition."
                    ],
                    "required": true,
                    "type": "str"
                },
                "ulimits": {
                    "description": [
                        "A list of ulimits to set in the container. This parameter maps to Ulimits in the Create a container section of the Docker Remote API and the --ulimit option to docker run."
                    ],
                    "elements": "dict",
                    "suboptions": {
                        "hardLimit": {
                            "description": [
                                "The hard limit for the ulimit type."
                            ]
                        },
                        "name": {
                            "description": [
                                "The type of the ulimit."
                            ]
                        },
                        "softLimit": {
                            "description": [
                                "The soft limit for the ulimit type."
                            ]
                        }
                    },
                    "type": "list"
                },
                "user": {
                    "description": [
                        "The user name to use inside the container. This parameter maps to User in the Create a container section of the Docker Remote API and the --user option to docker run."
                    ],
                    "type": "str"
                },
                "validate_certs": {
                    "default": true,
                    "description": [
                        "When set to \"no\", SSL certificates will not be validated for boto versions >= 2.6.0."
                    ],
                    "type": "bool"
                },
                "vcpus": {
                    "description": [
                        "The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares."
                    ],
                    "required": true,
                    "type": "int"
                },
                "volumes": {
                    "description": [
                        "A list of data volumes used in a job."
                    ],
                    "elements": "dict",
                    "suboptions": {
                        "host": {
                            "description": [
                                "The contents of the host parameter determine whether your data volume persists on the host container instance and where it is stored. If the host parameter is empty, then the Docker daemon assigns a host path for your data volume, but the data is not guaranteed to persist after the containers associated with it stop running. This is a dictionary with one property, sourcePath - The path on the host container instance that is presented to the container. If this parameter is empty,then the Docker daemon has assigned a host path for you. If the host parameter contains a sourcePath file location, then the data volume persists at the specified location on the host container instance until you delete it manually. If the sourcePath value does not exist on the host container instance, the Docker daemon creates it. If the location does exist, the contents of the source path folder are exported."
                            ]
                        },
                        "name": {
                            "description": [
                                "The name of the volume. Up to 255 letters (uppercase and lowercase), numbers, hyphens, and underscores are allowed. This name is referenced in the sourceVolume parameter of container definition mountPoints."
                            ]
                        }
                    },
                    "type": "list"
                }
            },
            "requirements": [
                "boto",
                "boto3",
                "python >= 2.6"
            ],
            "short_description": "Manage AWS Batch Job Definitions",
            "version_added": "1.0.0",
            "version_added_collection": "community.aws"
        },
        "examples": "\n---\n- hosts: localhost\n  gather_facts: no\n  vars:\n    state: present\n  tasks:\n- name: My Batch Job Definition\n  community.aws.aws_batch_job_definition:\n    job_definition_name: My Batch Job Definition\n    state: present\n    type: container\n    parameters:\n      Param1: Val1\n      Param2: Val2\n    image: <Docker Image URL>\n    vcpus: 1\n    memory: 512\n    command:\n      - python\n      - run_my_script.py\n      - arg1\n    job_role_arn: <Job Role ARN>\n    attempts: 3\n  register: job_definition_create_result\n\n- name: show results\n  ansible.builtin.debug: var=job_definition_create_result\n",
        "metadata": null,
        "return": {
            "output": {
                "description": "returns what action was taken, whether something was changed, invocation and response",
                "returned": "always",
                "sample": {
                    "aws_batch_job_definition_action": "none",
                    "changed": false,
                    "response": {
                        "job_definition_arn": "arn:aws:batch:....",
                        "job_definition_name": "<name>",
                        "status": "INACTIVE",
                        "type": "container"
                    }
                },
                "type": "dict"
            }
        }
    }
}
