{
    "community.kubevirt.kubevirt_cdi_upload": {
        "doc": {
            "author": "KubeVirt Team (@kubevirt)",
            "collection": "community.kubevirt",
            "description": [
                "Use Openshift Python SDK to create UploadTokenRequest objects.",
                "Transfer contents of local files to the CDI Upload Proxy."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/kubevirt/plugins/modules/kubevirt_cdi_upload.py",
            "has_action": false,
            "module": "kubevirt_cdi_upload",
            "notes": [
                "The OpenShift Python client wraps the K8s Python client, providing full access to all of the APIS and models available on both platforms. For API version details and additional information visit https://github.com/openshift/openshift-restclient-python",
                "To avoid SSL certificate validation errors when C(validate_certs) is I(True), the full certificate chain for the API server must be provided via C(ca_cert) or in the kubeconfig file."
            ],
            "options": {
                "api_key": {
                    "description": [
                        "Token used to authenticate with the API. Can also be specified via K8S_AUTH_API_KEY environment variable."
                    ],
                    "type": "str"
                },
                "ca_cert": {
                    "aliases": [
                        "ssl_ca_cert"
                    ],
                    "description": [
                        "Path to a CA certificate used to authenticate with the API. The full certificate chain must be provided to avoid certificate validation errors. Can also be specified via K8S_AUTH_SSL_CA_CERT environment variable."
                    ],
                    "type": "path"
                },
                "client_cert": {
                    "aliases": [
                        "cert_file"
                    ],
                    "description": [
                        "Path to a certificate used to authenticate with the API. Can also be specified via K8S_AUTH_CERT_FILE environment variable."
                    ],
                    "type": "path"
                },
                "client_key": {
                    "aliases": [
                        "key_file"
                    ],
                    "description": [
                        "Path to a key file used to authenticate with the API. Can also be specified via K8S_AUTH_KEY_FILE environment variable."
                    ],
                    "type": "path"
                },
                "context": {
                    "description": [
                        "The name of a context found in the config file. Can also be specified via K8S_AUTH_CONTEXT environment variable."
                    ],
                    "type": "str"
                },
                "host": {
                    "description": [
                        "Provide a URL for accessing the API. Can also be specified via K8S_AUTH_HOST environment variable."
                    ],
                    "type": "str"
                },
                "kubeconfig": {
                    "description": [
                        "Path to an existing Kubernetes config file. If not provided, and no other connection options are provided, the openshift client will attempt to load the default configuration file from I(~/.kube/config.json). Can also be specified via K8S_AUTH_KUBECONFIG environment variable."
                    ],
                    "type": "path"
                },
                "merge_type": {
                    "choices": [
                        "json",
                        "merge",
                        "strategic-merge"
                    ],
                    "description": [
                        "Whether to override the default patch merge approach with a specific type. By default, the strategic merge will typically be used."
                    ],
                    "type": "list"
                },
                "password": {
                    "description": [
                        "Provide a password for authenticating with the API. Can also be specified via K8S_AUTH_PASSWORD environment variable.",
                        "Please read the description of the C(username) option for a discussion of when this option is applicable."
                    ],
                    "type": "str"
                },
                "path": {
                    "description": [
                        "Path of local image file to transfer."
                    ]
                },
                "persist_config": {
                    "description": [
                        "Whether or not to save the kube config refresh tokens. Can also be specified via K8S_AUTH_PERSIST_CONFIG environment variable.",
                        "When the k8s context is using a user credentials with refresh tokens (like oidc or gke/gcloud auth), the token is refreshed by the k8s python client library but not saved by default. So the old refresh token can expire and the next auth might fail. Setting this flag to true will tell the k8s python client to save the new refresh token to the kube config file.",
                        "Default to false.",
                        "Please note that the current version of the k8s python client library does not support setting this flag to True yet.",
                        "The fix for this k8s python library is here: https://github.com/kubernetes-client/python-base/pull/169"
                    ],
                    "type": "bool"
                },
                "proxy": {
                    "description": [
                        "The URL of an HTTP proxy to use for the connection. Can also be specified via K8S_AUTH_PROXY environment variable.",
                        "Please note that this module does not pick up typical proxy settings from the environment (e.g. HTTP_PROXY)."
                    ],
                    "type": "str"
                },
                "pvc_name": {
                    "description": [
                        "Use to specify the name of the target PersistentVolumeClaim."
                    ],
                    "required": true
                },
                "pvc_namespace": {
                    "description": [
                        "Use to specify the namespace of the target PersistentVolumeClaim."
                    ],
                    "required": true
                },
                "upload_host": {
                    "description": [
                        "URL containing the host and port on which the CDI Upload Proxy is available.",
                        "More info: U(https://github.com/kubevirt/containerized-data-importer/blob/master/doc/upload.md#expose-cdi-uploadproxy-service)"
                    ]
                },
                "upload_host_validate_certs": {
                    "aliases": [
                        "upload_host_verify_ssl"
                    ],
                    "default": true,
                    "description": [
                        "Whether or not to verify the CDI Upload Proxy's SSL certificates against your system's CA trust store."
                    ],
                    "type": "bool"
                },
                "username": {
                    "description": [
                        "Provide a username for authenticating with the API. Can also be specified via K8S_AUTH_USERNAME environment variable.",
                        "Please note that this only works with clusters configured to use HTTP Basic Auth. If your cluster has a different form of authentication (e.g. OAuth2 in OpenShift), this option will not work as expected and you should look into the C(k8s_auth) module, as that might do what you need."
                    ],
                    "type": "str"
                },
                "validate_certs": {
                    "aliases": [
                        "verify_ssl"
                    ],
                    "description": [
                        "Whether or not to verify the API server's SSL certificates. Can also be specified via K8S_AUTH_VERIFY_SSL environment variable."
                    ],
                    "type": "bool"
                }
            },
            "requirements": [
                "python >= 2.7",
                "openshift >= 0.8.2",
                "requests >= 2.0.0"
            ],
            "short_description": "Upload local VM images to CDI Upload Proxy."
        },
        "examples": "\n- name: Upload local image to pvc-vm1\n  community.kubevirt.kubevirt_cdi_upload:\n    pvc_namespace: default\n    pvc_name: pvc-vm1\n    upload_host: https://localhost:8443\n    upload_host_validate_certs: false\n    path: /tmp/cirros-0.4.0-x86_64-disk.img\n",
        "metadata": null,
        "return": null
    }
}
