{
    "community.network.cnos_save": {
        "doc": {
            "author": "Anil Kumar Muraleedharan (@amuraleedhar)",
            "collection": "community.network",
            "description": [
                "This module allows you to copy the running configuration of a switch over its startup configuration. It is recommended to use this module shortly after any major configuration changes so they persist after a switch restart. This module uses SSH to manage network device configuration. The results of the operation will be placed in a directory named 'results' that must be created by the user in their local directory to where the playbook is run."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/network/plugins/modules/cnos_save.py",
            "has_action": false,
            "module": "cnos_save",
            "notes": [
                "For more information on using Ansible to manage Lenovo Network devices see U(https://www.ansible.com/ansible-lenovo)."
            ],
            "options": {
                "deviceType": {
                    "choices": [
                        "g8272_cnos",
                        "g8296_cnos",
                        "g8332_cnos",
                        "NE0152T",
                        "NE1072T",
                        "NE1032",
                        "NE1032T",
                        "NE10032",
                        "NE2572"
                    ],
                    "description": [
                        "This specifies the type of device where the method is executed. The choices NE1072T,NE1032,NE1032T,NE10032,NE2572 are added since Ansible 2.4. The choice NE0152T is added since 2.8"
                    ],
                    "required": true,
                    "type": "str"
                },
                "enablePassword": {
                    "description": [
                        "Configures the password used to enter Global Configuration command mode on the switch. If the switch does not request this password, the parameter is ignored.While generally the value should come from the inventory file, you can also specify it as a variable. This parameter is optional. If it is not specified, no default value will be used."
                    ],
                    "type": "str"
                },
                "host": {
                    "description": [
                        "This is the variable used to search the hosts file at /etc/ansible/hosts and identify the IP address of the device on which the template is going to be applied. Usually the Ansible keyword {{ inventory_hostname }} is specified in the playbook as an abstraction of the group of network elements that need to be configured."
                    ],
                    "required": true,
                    "type": "str"
                },
                "outputfile": {
                    "description": [
                        "This specifies the file path where the output of each command execution is saved. Each command that is specified in the merged template file and each response from the device are saved here. Usually the location is the results folder, but you can choose another location based on your write permission."
                    ],
                    "required": true,
                    "type": "str"
                },
                "password": {
                    "description": [
                        "Configures the password used to authenticate the connection to the remote device. The value of the password parameter is used to authenticate the SSH session. While generally the value should come from the inventory file, you can also specify it as a variable. This parameter is optional. If it is not specified, no default value will be used."
                    ],
                    "required": true,
                    "type": "str"
                },
                "username": {
                    "description": [
                        "Configures the username used to authenticate the connection to the remote device. The value of the username parameter is used to authenticate the SSH session. While generally the value should come from the inventory file, you can also specify it as a variable. This parameter is optional. If it is not specified, no default value will be used."
                    ],
                    "required": true,
                    "type": "str"
                }
            },
            "short_description": "Save the running configuration as the startup configuration on devices running Lenovo CNOS"
        },
        "examples": "\nTasks : The following are examples of using the module cnos_save. These are\n written in the main.yml file of the tasks directory.\n---\n- name: Test Save\n  community.network.cnos_save:\n      deviceType: \"{{ hostvars[inventory_hostname]['deviceType'] }}\"\n      outputfile: \"./results/test_save_{{ inventory_hostname }}_output.txt\"\n",
        "metadata": null,
        "return": {
            "msg": {
                "description": "Success or failure message",
                "returned": "always",
                "sample": "Switch Running Config is Saved to Startup Config",
                "type": "str"
            }
        }
    }
}
