{
    "community.windows.win_inet_proxy": {
        "doc": {
            "author": [
                "Jordan Borean (@jborean93)"
            ],
            "collection": "community.windows",
            "description": [
                "Used to set or remove proxy settings for Windows INet which includes Internet Explorer.",
                "WinINet is a framework used by interactive applications to submit web requests through.",
                "The proxy settings can also be used by other applications like Firefox, Chrome, and others but there is no definitive list."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/windows/plugins/modules/win_inet_proxy.py",
            "has_action": false,
            "module": "win_inet_proxy",
            "notes": [
                "This is not the same as the proxy settings set in WinHTTP through the C(netsh) command. Use the M(community.windows.win_http_proxy) module to manage that instead.",
                "These settings are by default set per user and not system wide. A registry property must be set independently from this module if you wish to apply the proxy for all users. See examples for more detail.",
                "If per user proxy settings are desired, use I(become) to become any local user on the host. No password is needed to be set for this to work.",
                "If the proxy requires authentication, set the credentials using the M(community.windows.win_credential) module. This requires I(become) to be used so the credential store can be accessed."
            ],
            "options": {
                "auto_config_url": {
                    "description": [
                        "The URL of a proxy configuration script.",
                        "Proxy configuration scripts are typically JavaScript files with the C(.pac) extension that implement the C(FindProxyForURL(url, host) function.",
                        "Omit, set to null or an empty string to remove the auto config URL.",
                        "This corresponds to the checkbox I(Use automatic configuration script) in the connection settings window."
                    ],
                    "type": "str"
                },
                "auto_detect": {
                    "default": true,
                    "description": [
                        "Whether to configure WinINet to automatically detect proxy settings through Web Proxy Auto-Detection C(WPAD).",
                        "This corresponds to the checkbox I(Automatically detect settings) in the connection settings window."
                    ],
                    "type": "bool"
                },
                "bypass": {
                    "description": [
                        "A list of hosts that will bypass the set proxy when being accessed.",
                        "Use C(<local>) to match hostnames that are not fully qualified domain names. This is useful when needing to connect to intranet sites using just the hostname. If defined, this should be the last entry in the bypass list.",
                        "Use C(<-loopback>) to stop automatically bypassing the proxy when connecting through any loopback address like C(127.0.0.1), C(localhost), or the local hostname.",
                        "Omit, set to null or an empty string/list to remove the bypass list.",
                        "If this is set then I(proxy) must also be set."
                    ],
                    "elements": "str",
                    "type": "list"
                },
                "connection": {
                    "description": [
                        "The name of the IE connection to set the proxy settings for.",
                        "These are the connections under the I(Dial-up and Virtual Private Network) header in the IE settings.",
                        "When omitted, the default LAN connection is used."
                    ],
                    "type": "str"
                },
                "proxy": {
                    "description": [
                        "A string or dict that specifies the proxy to be set.",
                        "If setting a string, should be in the form C(hostname), C(hostname:port), or C(protocol=hostname:port).",
                        "If the port is undefined, the default port for the protocol in use is used.",
                        "If setting a dict, the keys should be the protocol and the values should be the hostname and/or port for that protocol.",
                        "Valid protocols are C(http), C(https), C(ftp), and C(socks).",
                        "Omit, set to null or an empty string to remove the proxy settings."
                    ],
                    "type": "raw"
                }
            },
            "seealso": [
                {
                    "module": "community.windows.win_http_proxy"
                },
                {
                    "module": "community.windows.win_credential"
                }
            ],
            "short_description": "Manages proxy settings for WinINet and Internet Explorer"
        },
        "examples": "\n# This should be set before running the win_inet_proxy module\n- name: Configure IE proxy settings to apply to all users\n  ansible.windows.win_regedit:\n    path: HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\n    name: ProxySettingsPerUser\n    data: 0\n    type: dword\n    state: present\n\n# This should be set before running the win_inet_proxy module\n- name: Configure IE proxy settings to apply per user\n  ansible.windows.win_regedit:\n    path: HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\n    name: ProxySettingsPerUser\n    data: 1\n    type: dword\n    state: present\n\n- name: Configure IE proxy to use auto detected settings without an explicit proxy\n  win_inet_proxy:\n    auto_detect: yes\n\n- name: Configure IE proxy to use auto detected settings with a configuration script\n  win_inet_proxy:\n    auto_detect: yes\n    auto_config_url: http://proxy.ansible.com/proxy.pac\n\n- name: Configure IE to use explicit proxy host\n  win_inet_proxy:\n    auto_detect: yes\n    proxy: ansible.proxy\n\n- name: Configure IE to use explicit proxy host with port and without auto detection\n  win_inet_proxy:\n    auto_detect: no\n    proxy: ansible.proxy:8080\n\n- name: Configure IE to use a specific proxy per protocol\n  win_inet_proxy:\n    proxy:\n      http: ansible.proxy:8080\n      https: ansible.proxy:8443\n\n- name: Configure IE to use a specific proxy per protocol using a string\n  win_inet_proxy:\n    proxy: http=ansible.proxy:8080;https=ansible.proxy:8443\n\n- name: Set a proxy with a bypass list\n  win_inet_proxy:\n    proxy: ansible.proxy\n    bypass:\n    - server1\n    - server2\n    - <-loopback>\n    - <local>\n\n- name: Remove any explicit proxies that are set\n  win_inet_proxy:\n    proxy: ''\n    bypass: ''\n\n# This should be done after setting the IE proxy with win_inet_proxy\n- name: Import IE proxy configuration to WinHTTP\n  win_http_proxy:\n    source: ie\n\n# Explicit credentials can only be set per user and require become to work\n- name: Set credential to use for proxy auth\n  win_credential:\n    name: ansible.proxy  # The name should be the FQDN of the proxy host\n    type: generic_password\n    username: proxyuser\n    secret: proxypass\n    state: present\n  become: yes\n  become_user: '{{ ansible_user }}'\n  become_method: runas\n",
        "metadata": null,
        "return": null
    }
}
