{
    "community.network.ce_config": {
        "doc": {
            "author": "QijunPan (@QijunPan)",
            "collection": "community.network",
            "description": [
                "Huawei CloudEngine configurations use a simple block indent file syntax for segmenting configuration into sections.  This module provides an implementation for working with CloudEngine configuration sections in a deterministic way.  This module works with CLI transports."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/network/plugins/modules/ce_config.py",
            "has_action": false,
            "module": "ce_config",
            "notes": [
                "Recommended connection is C(network_cli).",
                "This module also works with C(local) connections for legacy playbooks."
            ],
            "options": {
                "after": {
                    "description": [
                        "The ordered set of commands to append to the end of the command stack if a change needs to be made.  Just like with I(before) this allows the playbook designer to append a set of commands to be executed after the command set."
                    ]
                },
                "backup": {
                    "default": "no",
                    "description": [
                        "This argument will cause the module to create a full backup of the current C(current-configuration) from the remote device before any changes are made. If the C(backup_options) value is not given, the backup file is written to the C(backup) folder in the playbook root directory. If the directory does not exist, it is created."
                    ],
                    "type": "bool"
                },
                "backup_options": {
                    "description": [
                        "This is a dict object containing configurable options related to backup file path. The value of this option is read only when C(backup) is set to I(yes), if C(backup) is set to I(no) this option will be silently ignored."
                    ],
                    "suboptions": {
                        "dir_path": {
                            "description": [
                                "This option provides the path ending with directory name in which the backup configuration file will be stored. If the directory does not exist it will be first created and the filename is either the value of C(filename) or default filename as described in C(filename) options description. If the path value is not given in that case a I(backup) directory will be created in the current working directory and backup configuration will be copied in C(filename) within I(backup) directory."
                            ],
                            "type": "path"
                        },
                        "filename": {
                            "description": [
                                "The filename to be used to store the backup configuration. If the filename is not given it will be generated based on the hostname, current time and date in format defined by <hostname>_config.<current-date>@<current-time>"
                            ]
                        }
                    },
                    "type": "dict"
                },
                "before": {
                    "description": [
                        "The ordered set of commands to push on to the command stack if a change needs to be made.  This allows the playbook designer the opportunity to perform configuration commands prior to pushing any changes without affecting how the set of commands are matched against the system."
                    ]
                },
                "config": {
                    "description": [
                        "The module, by default, will connect to the remote device and retrieve the current current-configuration to use as a base for comparing against the contents of source.  There are times when it is not desirable to have the task get the current-configuration for every task in a playbook.  The I(config) argument allows the implementer to pass in the configuration to use as the base config for comparison."
                    ]
                },
                "defaults": {
                    "default": "no",
                    "description": [
                        "The I(defaults) argument will influence how the current-configuration is collected from the device.  When the value is set to true, the command used to collect the current-configuration is append with the all keyword.  When the value is set to false, the command is issued without the all keyword."
                    ],
                    "type": "bool"
                },
                "lines": {
                    "description": [
                        "The ordered set of commands that should be configured in the section.  The commands must be the exact same commands as found in the device current-configuration.  Be sure to note the configuration command syntax as some commands are automatically modified by the device config parser."
                    ]
                },
                "match": {
                    "choices": [
                        "line",
                        "strict",
                        "exact",
                        "none"
                    ],
                    "default": "line",
                    "description": [
                        "Instructs the module on the way to perform the matching of the set of commands against the current device config.  If match is set to I(line), commands are matched line by line.  If match is set to I(strict), command lines are matched with respect to position.  If match is set to I(exact), command lines must be an equal match.  Finally, if match is set to I(none), the module will not attempt to compare the source configuration with the current-configuration on the remote device."
                    ]
                },
                "parents": {
                    "description": [
                        "The ordered set of parents that uniquely identify the section or hierarchy the commands should be checked against.  If the parents argument is omitted, the commands are checked against the set of top level or global commands."
                    ]
                },
                "replace": {
                    "choices": [
                        "line",
                        "block"
                    ],
                    "default": "line",
                    "description": [
                        "Instructs the module on the way to perform the configuration on the device.  If the replace argument is set to I(line) then the modified lines are pushed to the device in configuration mode.  If the replace argument is set to I(block) then the entire command block is pushed to the device in configuration mode if any line is not correct."
                    ]
                },
                "save": {
                    "default": "no",
                    "description": [
                        "The C(save) argument instructs the module to save the current-configuration to saved-configuration.  This operation is performed after any changes are made to the current running config.  If no changes are made, the configuration is still saved to the startup config.  This option will always cause the module to return changed."
                    ],
                    "type": "bool"
                },
                "src": {
                    "description": [
                        "The I(src) argument provides a path to the configuration file to load into the remote system.  The path can either be a full system path to the configuration file if the value starts with / or relative to the root of the implemented role or playbook. This argument is mutually exclusive with the I(lines) and I(parents) arguments."
                    ]
                }
            },
            "short_description": "Manage Huawei CloudEngine configuration sections."
        },
        "examples": "\n# Note: examples below use the following provider dict to handle\n#       transport and authentication to the node.\n\n- name: CloudEngine config test\n  hosts: cloudengine\n  connection: local\n  gather_facts: no\n  vars:\n    cli:\n      host: \"{{ inventory_hostname }}\"\n      port: \"{{ ansible_ssh_port }}\"\n      username: \"{{ username }}\"\n      password: \"{{ password }}\"\n      transport: cli\n\n  tasks:\n  - name: \"Configure top level configuration and save it\"\n    community.network.ce_config:\n      lines: sysname {{ inventory_hostname }}\n      save: yes\n      provider: \"{{ cli }}\"\n\n  - name: \"Configure acl configuration and save it\"\n    community.network.ce_config:\n      lines:\n        - rule 10 permit source 1.1.1.1 32\n        - rule 20 permit source 2.2.2.2 32\n        - rule 30 permit source 3.3.3.3 32\n        - rule 40 permit source 4.4.4.4 32\n        - rule 50 permit source 5.5.5.5 32\n      parents: acl 2000\n      before: undo acl 2000\n      match: exact\n      provider: \"{{ cli }}\"\n\n  - name: \"Configure acl configuration and save it\"\n    community.network.ce_config:\n      lines:\n        - rule 10 permit source 1.1.1.1 32\n        - rule 20 permit source 2.2.2.2 32\n        - rule 30 permit source 3.3.3.3 32\n        - rule 40 permit source 4.4.4.4 32\n      parents: acl 2000\n      before: undo acl 2000\n      replace: block\n      provider: \"{{ cli }}\"\n\n  - name: Configurable backup path\n    community.network.ce_config:\n      lines: sysname {{ inventory_hostname }}\n      provider: \"{{ cli }}\"\n      backup: yes\n      backup_options:\n        filename: backup.cfg\n        dir_path: /home/user\n",
        "metadata": null,
        "return": {
            "backup_path": {
                "description": "The full path to the backup file",
                "returned": "when backup is yes",
                "sample": "/playbooks/ansible/backup/ce_config.2016-07-16@22:28:34",
                "type": "str"
            },
            "updates": {
                "description": "The set of commands that will be pushed to the remote device",
                "returned": "Only when lines is specified.",
                "sample": [
                    "...",
                    "..."
                ],
                "type": "list"
            }
        }
    }
}
