{
    "community.network.cnos_system": {
        "doc": {
            "author": "Anil Kumar Muraleedharan (@amuraleedhar)",
            "collection": "community.network",
            "description": [
                "This module provides declarative management of node system attributes on Lenovo CNOS devices.  It provides an option to configure host system parameters or remove those parameters from the device active configuration."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/network/plugins/modules/cnos_system.py",
            "has_action": false,
            "module": "cnos_system",
            "options": {
                "domain_name": {
                    "description": [
                        "Configures the default domain name suffix to be used when referencing this node by its FQDN.  This argument accepts either a list of domain names or a list of dicts that configure the domain name and VRF name or keyword 'default'. See examples."
                    ]
                },
                "domain_search": {
                    "description": [
                        "Configures a list of domain name suffixes to search when performing DNS name resolution. This argument accepts either a list of domain names or a list of dicts that configure the domain name and VRF name or keyword 'default'. See examples."
                    ]
                },
                "hostname": {
                    "description": [
                        "Configure the device hostname parameter. This option takes an ASCII string value or keyword 'default'"
                    ]
                },
                "lookup_enabled": {
                    "description": [
                        "Administrative control for enabling or disabling DNS lookups. When this argument is set to True, lookups are performed and when it is set to False, lookups are not performed."
                    ],
                    "type": "bool"
                },
                "lookup_source": {
                    "description": [
                        "Provides one or more source interfaces to use for performing DNS lookups. The interface must be a valid interface configured. on the device."
                    ]
                },
                "name_servers": {
                    "description": [
                        "List of DNS name servers by IP address to use to perform name resolution lookups.  This argument accepts either a list of DNS servers or a list of hashes that configure the name server and VRF name or keyword 'default'. See examples."
                    ]
                },
                "state": {
                    "choices": [
                        "present",
                        "absent"
                    ],
                    "default": "present",
                    "description": [
                        "State of the configuration values in the device's current active configuration.  When set to I(present), the values should be configured in the device active configuration and when set to I(absent) the values should not be in the device active configuration"
                    ]
                }
            },
            "short_description": "Manage the system attributes on Lenovo CNOS devices"
        },
        "examples": "\n- name: Configure hostname and domain-name\n  community.network.cnos_system:\n    hostname: cnos01\n    domain_name: test.example.com\n\n- name: Remove configuration\n  community.network.cnos_system:\n    state: absent\n\n- name: Configure name servers\n  community.network.cnos_system:\n    name_servers:\n      - 8.8.8.8\n      - 8.8.4.4\n\n- name: Configure DNS Lookup sources\n  community.network.cnos_system:\n    lookup_source: MgmtEth0/0/CPU0/0\n    lookup_enabled: yes\n\n- name: Configure name servers with VRF support\n  nxos_system:\n    name_servers:\n      - { server: 8.8.8.8, vrf: mgmt }\n      - { server: 8.8.4.4, vrf: mgmt }\n",
        "metadata": null,
        "return": {
            "commands": {
                "description": "The list of configuration mode commands to send to the device",
                "returned": "always",
                "sample": [
                    "hostname cnos01",
                    "ip domain-name test.example.com vrf default"
                ],
                "type": "list"
            }
        }
    }
}
