{
    "community.routeros.command": {
        "doc": {
            "author": "Egor Zaitsev (@heuels)",
            "collection": "community.routeros",
            "description": [
                "Sends arbitrary commands to an RouterOS node and returns the results read from the device. This module includes an argument that will cause the module to wait for a specific condition before returning or timing out if the condition is not met."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/community/routeros/plugins/modules/command.py",
            "has_action": false,
            "module": "command",
            "options": {
                "commands": {
                    "description": [
                        "List of commands to send to the remote RouterOS device over the configured provider. The resulting output from the command is returned. If the I(wait_for) argument is provided, the module is not returned until the condition is satisfied or the number of retries has expired."
                    ],
                    "required": true
                },
                "interval": {
                    "default": 1,
                    "description": [
                        "Configures the interval in seconds to wait between retries of the command. If the command does not pass the specified conditions, the interval indicates how long to wait before trying the command again."
                    ]
                },
                "match": {
                    "choices": [
                        "any",
                        "all"
                    ],
                    "default": "all",
                    "description": [
                        "The I(match) argument is used in conjunction with the I(wait_for) argument to specify the match policy.  Valid values are C(all) or C(any).  If the value is set to C(all) then all conditionals in the wait_for must be satisfied.  If the value is set to C(any) then only one of the values must be satisfied."
                    ]
                },
                "retries": {
                    "default": 10,
                    "description": [
                        "Specifies the number of retries a command should by tried before it is considered failed. The command is run on the target device every retry and evaluated against the I(wait_for) conditions."
                    ]
                },
                "wait_for": {
                    "description": [
                        "List of conditions to evaluate against the output of the command. The task will wait for each condition to be true before moving forward. If the conditional is not true within the configured number of retries, the task fails. See examples."
                    ]
                }
            },
            "short_description": "Run commands on remote devices running MikroTik RouterOS"
        },
        "examples": "\n- name: Run command on remote devices\n  community.routeros.command:\n    commands: /system routerboard print\n\n- name: Run command and check to see if output contains routeros\n  community.routeros.command:\n    commands: /system resource print\n    wait_for: result[0] contains MikroTik\n\n- name: Run multiple commands on remote nodes\n  community.routeros.command:\n    commands:\n      - /system routerboard print\n      - /system identity print\n\n- name: Run multiple commands and evaluate the output\n  community.routeros.command:\n    commands:\n      - /system routerboard print\n      - /interface ethernet print\n    wait_for:\n      - result[0] contains x86\n      - result[1] contains ether1\n",
        "metadata": null,
        "return": {
            "failed_conditions": {
                "description": "The list of conditionals that have failed",
                "returned": "failed",
                "sample": [
                    "...",
                    "..."
                ],
                "type": "list"
            },
            "stdout": {
                "description": "The set of responses from the commands",
                "returned": "always apart from low level errors (such as action plugin)",
                "sample": [
                    "...",
                    "..."
                ],
                "type": "list"
            },
            "stdout_lines": {
                "description": "The value of stdout split into a list",
                "returned": "always apart from low level errors (such as action plugin)",
                "sample": [
                    [
                        "...",
                        "..."
                    ],
                    [
                        "..."
                    ],
                    [
                        "..."
                    ]
                ],
                "type": "list"
            }
        }
    }
}
