{
    "f5networks.f5_modules.bigip_ucs": {
        "doc": {
            "author": [
                "Tim Rupp (@caphrim007)",
                "Wojciech Wypior (@wojtek0806)"
            ],
            "collection": "f5networks.f5_modules",
            "description": [
                "Manage upload, installation, and removal of UCS files on a BIG-IP system. A user configuration set (UCS) is a backup file that contains BIG-IP configuration data that can be used to fully restore a BIG-IP system in the event of a failure or RMA replacement."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/f5networks/f5_modules/plugins/modules/bigip_ucs.py",
            "has_action": false,
            "module": "bigip_ucs",
            "notes": [
                "Only the most basic checks are performed by this module. Other checks and considerations need to be taken into account. See https://support.f5.com/kb/en-us/solutions/public/11000/300/sol11318.html",
                "This module does not handle devices with the FIPS 140 HSM.",
                "This module does not handle BIG-IPs systems on the 6400, 6800, 8400, or 8800 hardware platforms.",
                "This module does not verify the new or replaced SSH keys from the UCS file are synchronized between the BIG-IP system and the SCCP.",
                "This module does not support the 'rma' option.",
                "This module does not support restoring a UCS archive on a BIG-IP 1500, 3400, 4100, 6400, 6800, or 8400 hardware platforms other than the system from which the backup was created.",
                "The UCS restore operation restores the full configuration only if the hostname of the target system matches the hostname on which the UCS archive was created. If the hostname does not match, only the shared configuration is restored. You can ensure hostnames match by using the C(bigip_hostname) Ansible module in a task before using this module.",
                "This module does not support re-licensing a BIG-IP restored from a UCS.",
                "This module does not support restoring encrypted archives on replacement RMA unit.",
                "For more information on using Ansible to manage F5 Networks devices see U(https://www.ansible.com/integrations/networks/f5).",
                "Requires BIG-IP software version >= 12.",
                "The F5 modules only manipulate the running configuration of the F5 product. To ensure that BIG-IP specific configuration persists to disk, be sure to include at least one task that uses the M(f5networks.f5_modules.bigip_config) module to save the running configuration. Refer to the module's documentation for the correct usage of the module to save your running configuration."
            ],
            "options": {
                "force": {
                    "default": false,
                    "description": [
                        "If C(yes), the system uploads the file every time and replaces the file on the device. If C(no), the file is only uploaded if it does not already exist. Generally should only be C(yes) in cases where you believe the image was corrupted during upload."
                    ],
                    "type": "bool"
                },
                "include_chassis_level_config": {
                    "description": [
                        "During restoration of the UCS file, includes chassis level configuration that is shared among boot volume sets. For example, the cluster default configuration."
                    ],
                    "type": "bool"
                },
                "no_license": {
                    "description": [
                        "Performs a full restore of the UCS file and all the files it contains, with the exception of the license file. The option must be used to restore a UCS on RMA (Returned Materials Authorization) devices."
                    ],
                    "type": "bool"
                },
                "no_platform_check": {
                    "description": [
                        "Bypasses the platform check and allows installation of a UCS that was created using a different platform. By default (without this option), installation of a UCS created from a different platform is not allowed."
                    ],
                    "type": "bool"
                },
                "passphrase": {
                    "description": [
                        "Specifies the passphrase that is necessary to load the specified UCS file."
                    ],
                    "type": "str"
                },
                "provider": {
                    "description": [
                        "A dict object containing connection details."
                    ],
                    "suboptions": {
                        "auth_provider": {
                            "description": [
                                "Configures the auth provider for to obtain authentication tokens from the remote device.",
                                "This option is really used when working with BIG-IQ devices."
                            ],
                            "type": "str"
                        },
                        "no_f5_teem": {
                            "default": false,
                            "description": [
                                "If C(yes), TEEM telemetry data is not sent to F5.",
                                "You may omit this option by setting the environment variable C(F5_TELEMETRY_OFF).",
                                "Previously used variable C(F5_TEEM) is deprecated as its name was confusing."
                            ],
                            "type": "bool"
                        },
                        "password": {
                            "aliases": [
                                "pass",
                                "pwd"
                            ],
                            "description": [
                                "The password for the user account used to connect to the BIG-IP.",
                                "You may omit this option by setting the environment variable C(F5_PASSWORD)."
                            ],
                            "required": true,
                            "type": "str"
                        },
                        "server": {
                            "description": [
                                "The BIG-IP host.",
                                "You may omit this option by setting the environment variable C(F5_SERVER)."
                            ],
                            "required": true,
                            "type": "str"
                        },
                        "server_port": {
                            "default": 443,
                            "description": [
                                "The BIG-IP server port.",
                                "You may omit this option by setting the environment variable C(F5_SERVER_PORT)."
                            ],
                            "type": "int"
                        },
                        "timeout": {
                            "description": [
                                "Specifies the timeout in seconds for communicating with the network device for either connecting or sending commands.  If the timeout is exceeded before the operation is completed, the module will error."
                            ],
                            "type": "int"
                        },
                        "transport": {
                            "choices": [
                                "rest"
                            ],
                            "default": "rest",
                            "description": [
                                "Configures the transport connection to use when connecting to the remote device."
                            ],
                            "type": "str"
                        },
                        "user": {
                            "description": [
                                "The username to connect to the BIG-IP with. This user must have administrative privileges on the device.",
                                "You may omit this option by setting the environment variable C(F5_USER)."
                            ],
                            "required": true,
                            "type": "str"
                        },
                        "validate_certs": {
                            "default": true,
                            "description": [
                                "If C(no), SSL certificates are not validated. Use this only on personally controlled sites using self-signed certificates.",
                                "You may omit this option by setting the environment variable C(F5_VALIDATE_CERTS)."
                            ],
                            "type": "bool"
                        }
                    },
                    "type": "dict",
                    "version_added": "1.0.0",
                    "version_added_collection": "f5networks.f5_modules"
                },
                "reset_trust": {
                    "description": [
                        "When specified, the device and trust domain certs and keys are not loaded from the UCS. Instead, a new set is generated."
                    ],
                    "type": "bool"
                },
                "state": {
                    "choices": [
                        "absent",
                        "installed",
                        "present"
                    ],
                    "default": "present",
                    "description": [
                        "When C(installed), ensures the UCS is uploaded and installed on the system. When C(present), ensures the UCS is uploaded. When C(absent), the UCS is removed from the system. When C(installed), the uploading of the UCS is idempotent, however the installation of that configuration is not idempotent."
                    ],
                    "type": "str"
                },
                "ucs": {
                    "description": [
                        "The path to the UCS file to install. The parameter must be provided if the C(state) is either C(installed) or C(activated). When C(state) is C(absent), the full path for this parameter is ignored and only the filename is used to select a UCS for removal. Therefore you could specify C(/foo/bar/test.ucs) and this module would only look for C(test.ucs)."
                    ],
                    "required": true,
                    "type": "str"
                }
            },
            "short_description": "Manage upload, installation, and removal of UCS files",
            "version_added": "1.0.0",
            "version_added_collection": "f5networks.f5_modules"
        },
        "examples": "\n- name: Upload UCS\n  bigip_ucs:\n    ucs: /root/bigip.localhost.localdomain.ucs\n    state: present\n    provider:\n      server: lb.mydomain.com\n      user: admin\n      password: secret\n  delegate_to: localhost\n\n- name: Install (upload, install) UCS.\n  bigip_ucs:\n    ucs: /root/bigip.localhost.localdomain.ucs\n    state: installed\n    provider:\n      server: lb.mydomain.com\n      user: admin\n      password: secret\n  delegate_to: localhost\n\n- name: Install (upload, install) UCS without installing the license portion\n  bigip_ucs:\n    ucs: /root/bigip.localhost.localdomain.ucs\n    state: installed\n    no_license: yes\n    provider:\n      server: lb.mydomain.com\n      user: admin\n      password: secret\n  delegate_to: localhost\n\n- name: Install (upload, install) UCS except the license, and bypassing the platform check\n  bigip_ucs:\n    ucs: /root/bigip.localhost.localdomain.ucs\n    state: installed\n    no_license: yes\n    no_platform_check: yes\n    provider:\n      server: lb.mydomain.com\n      user: admin\n      password: secret\n  delegate_to: localhost\n\n- name: Install (upload, install) UCS using a passphrase necessary to load the UCS\n  bigip_ucs:\n    ucs: /root/bigip.localhost.localdomain.ucs\n    state: installed\n    passphrase: MyPassphrase1234\n    provider:\n      server: lb.mydomain.com\n      user: admin\n      password: secret\n  delegate_to: localhost\n\n- name: Remove uploaded UCS file\n  bigip_ucs:\n    ucs: bigip.localhost.localdomain.ucs\n    state: absent\n    provider:\n      server: lb.mydomain.com\n      user: admin\n      password: secret\n  delegate_to: localhost\n",
        "metadata": null,
        "return": null
    }
}
