{
    "junipernetworks.junos.junos_facts": {
        "doc": {
            "author": "Nathaniel Case (@Qalthos)",
            "collection": "junipernetworks.junos",
            "description": [
                "Collects fact information from a remote device running the Junos operating system.  By default, the module will collect basic fact information from the device to be included with the hostvars. Additional fact information can be collected based on the configured set of arguments."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible_collections/junipernetworks/junos/plugins/modules/junos_facts.py",
            "has_action": true,
            "module": "junos_facts",
            "notes": [
                "Ensure I(config_format) used to retrieve configuration from device is supported by junos version running on device.",
                "With I(config_format = json), configuration in the results will be a dictionary(and not a JSON string)",
                "This module requires the netconf system service be enabled on the remote device being managed.",
                "Tested against vSRX JUNOS version 15.1X49-D15.4, vqfx-10000 JUNOS Version 15.1X53-D60.4.",
                "Recommended connection is C(netconf). See L(the Junos OS Platform Options,../network/user_guide/platform_junos.html).",
                "This module also works with C(local) connections for legacy playbooks.",
                "Fetching old style facts requires junos-eznc library to be installed on control node and the device login credentials must be given in provider option.",
                "For information on using CLI and netconf see the :ref:`Junos OS Platform Options guide <junos_platform_options>`",
                "For more information on using Ansible to manage network devices see the :ref:`Ansible Network Guide <network_guide>`",
                "For more information on using Ansible to manage Juniper network devices see U(https://www.ansible.com/ansible-juniper)."
            ],
            "options": {
                "config_format": {
                    "choices": [
                        "xml",
                        "text",
                        "set",
                        "json"
                    ],
                    "default": "text",
                    "description": [
                        "The I(config_format) argument specifies the format of the configuration when serializing output from the device. This argument is applicable only when C(config) value is present in I(gather_subset). The I(config_format) should be supported by the junos version running on device. This value is not applicable while fetching old style facts that is when C(ofacts) value is present in value if I(gather_subset) value. This option is valid only for C(gather_subset) values."
                    ],
                    "required": false,
                    "type": "str"
                },
                "gather_network_resources": {
                    "description": [
                        "When supplied, this argument will restrict the facts collected to a given subset. Possible values for this argument include all and the resources like interfaces, vlans etc. Can specify a list of values to include a larger subset. Values can also be used with an initial C(!) to specify that a specific subset should not be collected. Valid subsets are 'all', 'interfaces', 'lacp', 'lacp_interfaces', 'lag_interfaces', 'l2_interfaces', 'l3_interfaces', 'lldp_global', 'lldp_interfaces', 'vlans'."
                    ],
                    "elements": "str",
                    "required": false,
                    "type": "list"
                },
                "gather_subset": {
                    "default": [
                        "!config"
                    ],
                    "description": [
                        "When supplied, this argument will restrict the facts collected to a given subset.  Possible values for this argument include all, hardware, config, and interfaces.  Can specify a list of values to include a larger subset.  Values can also be used with an initial C(!) to specify that a specific subset should not be collected. To maintain backward compatibility old style facts can be retrieved by explicitly adding C(ofacts)  to value, this requires junos-eznc to be installed as a prerequisite. Valid value of gather_subset are default, hardware, config, interfaces, ofacts. If C(ofacts) is present in the list it fetches the old style facts (fact keys without 'ansible_' prefix) and it requires junos-eznc library to be installed on control node and the device login credentials must be given in C(provider) option."
                    ],
                    "elements": "str",
                    "required": false,
                    "type": "list"
                },
                "provider": {
                    "description": [
                        "B(Deprecated)",
                        "Starting with Ansible 2.5 we recommend using C(connection: network_cli) or C(connection: netconf).",
                        "For more information please see the L(Junos OS Platform Options guide, ../network/user_guide/platform_junos.html).",
                        "HORIZONTALLINE",
                        "A dict object containing connection details."
                    ],
                    "suboptions": {
                        "host": {
                            "description": [
                                "Specifies the DNS host name or address for connecting to the remote device over the specified transport.  The value of host is used as the destination address for the transport."
                            ],
                            "type": "str"
                        },
                        "password": {
                            "description": [
                                "Specifies the password to use to authenticate the connection to the remote device.   This value is used to authenticate the SSH session. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_PASSWORD) will be used instead."
                            ],
                            "type": "str"
                        },
                        "port": {
                            "description": [
                                "Specifies the port to use when building the connection to the remote device.  The port value will default to the well known SSH port of 22 (for C(transport=cli)) or port 830 (for C(transport=netconf)) device."
                            ],
                            "type": "int"
                        },
                        "ssh_keyfile": {
                            "description": [
                                "Specifies the SSH key to use to authenticate the connection to the remote device.   This value is the path to the key used to authenticate the SSH session. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_SSH_KEYFILE) will be used instead."
                            ],
                            "type": "path"
                        },
                        "timeout": {
                            "description": [
                                "Specifies the timeout in seconds for communicating with the network device for either connecting or sending commands.  If the timeout is exceeded before the operation is completed, the module will error."
                            ],
                            "type": "int"
                        },
                        "transport": {
                            "choices": [
                                "cli",
                                "netconf"
                            ],
                            "default": "netconf",
                            "description": [
                                "Configures the transport connection to use when connecting to the remote device."
                            ],
                            "type": "str"
                        },
                        "username": {
                            "description": [
                                "Configures the username to use to authenticate the connection to the remote device.  This value is used to authenticate the SSH session. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_USERNAME) will be used instead."
                            ],
                            "type": "str"
                        }
                    },
                    "type": "dict"
                }
            },
            "requirements": [
                "ncclient (>=v0.5.2)"
            ],
            "short_description": "Collect facts from remote devices running Juniper Junos",
            "version_added": "1.0.0",
            "version_added_collection": "junipernetworks.junos"
        },
        "examples": "\n- name: collect default set of facts\n  junipernetworks.junos.junos_facts:\n\n- name: collect default set of facts and configuration\n  junipernetworks.junos.junos_facts:\n    gather_subset: config\n\n- name: Gather legacy and resource facts\n  junipernetworks.junos.junos_facts:\n    gather_subset: all\n    gather_network_resources: all\n",
        "metadata": null,
        "return": {
            "ansible_facts": {
                "description": "Returns the facts collect from the device",
                "returned": "always",
                "type": "dict"
            }
        }
    }
}
