{
    "unarchive": {
        "doc": {
            "author": "Michael DeHaan",
            "collection": "ansible.builtin",
            "description": [
                "The C(unarchive) module unpacks an archive. It will not unpack a compressed file that does not contain an archive.",
                "By default, it will copy the source file from the local system to the target before unpacking.",
                "Set C(remote_src=yes) to unpack an archive which already exists on the target.",
                "If checksum validation is desired, use M(ansible.builtin.get_url) or M(ansible.builtin.uri) instead to fetch the file and set C(remote_src=yes).",
                "For Windows targets, use the M(community.windows.win_unzip) module instead."
            ],
            "filename": "/Users/ssbarnea/.pyenv/versions/3.9.2/lib/python3.9/site-packages/ansible/modules/unarchive.py",
            "has_action": true,
            "module": "unarchive",
            "notes": [
                "Requires C(zipinfo) and C(gtar)/C(unzip) command on target host.",
                "Can handle I(.zip) files using C(unzip) as well as I(.tar), I(.tar.gz), I(.tar.bz2) and I(.tar.xz) files using C(gtar).",
                "Does not handle I(.gz) files, I(.bz2) files or I(.xz) files that do not contain a I(.tar) archive.",
                "Uses gtar's C(--diff) arg to calculate if changed or not. If this C(arg) is not supported, it will always unpack the archive.",
                "Existing files/directories in the destination which are not in the archive are not touched. This is the same behavior as a normal archive extraction.",
                "Existing files/directories in the destination which are not in the archive are ignored for purposes of deciding if the archive should be unpacked or not.",
                "Supports C(check_mode)."
            ],
            "options": {
                "attributes": {
                    "aliases": [
                        "attr"
                    ],
                    "description": [
                        "The attributes the resulting file or directory should have.",
                        "To get supported flags look at the man page for I(chattr) on the target system.",
                        "This string should contain the attributes in the same order as the one displayed by I(lsattr).",
                        "The C(=) operator is assumed as default, otherwise C(+) or C(-) operators need to be included in the string."
                    ],
                    "type": "str",
                    "version_added": "2.3",
                    "version_added_collection": "ansible.builtin"
                },
                "copy": {
                    "default": true,
                    "description": [
                        "If true, the file is copied from local 'master' to the target machine, otherwise, the plugin will look for src archive at the target machine.",
                        "This option has been deprecated in favor of C(remote_src).",
                        "This option is mutually exclusive with C(remote_src)."
                    ],
                    "type": "bool"
                },
                "creates": {
                    "description": [
                        "If the specified absolute path (file or directory) already exists, this step will B(not) be run."
                    ],
                    "type": "path",
                    "version_added": "1.6",
                    "version_added_collection": "ansible.builtin"
                },
                "decrypt": {
                    "default": true,
                    "description": [
                        "This option controls the autodecryption of source files using vault."
                    ],
                    "type": "bool",
                    "version_added": "2.4",
                    "version_added_collection": "ansible.builtin"
                },
                "dest": {
                    "description": [
                        "Remote absolute path where the archive should be unpacked."
                    ],
                    "required": true,
                    "type": "path"
                },
                "exclude": {
                    "description": [
                        "List the directory and file entries that you would like to exclude from the unarchive action."
                    ],
                    "type": "list",
                    "version_added": "2.1",
                    "version_added_collection": "ansible.builtin"
                },
                "extra_opts": {
                    "default": "",
                    "description": [
                        "Specify additional options by passing in an array.",
                        "Each space-separated command-line option should be a new element of the array. See examples.",
                        "Command-line options with multiple elements must use multiple lines in the array, one for each element."
                    ],
                    "type": "list",
                    "version_added": "2.1",
                    "version_added_collection": "ansible.builtin"
                },
                "group": {
                    "description": [
                        "Name of the group that should own the file/directory, as would be fed to I(chown)."
                    ],
                    "type": "str"
                },
                "keep_newer": {
                    "default": false,
                    "description": [
                        "Do not replace existing files that are newer than files from the archive."
                    ],
                    "type": "bool",
                    "version_added": "2.1",
                    "version_added_collection": "ansible.builtin"
                },
                "list_files": {
                    "default": false,
                    "description": [
                        "If set to True, return the list of files that are contained in the tarball."
                    ],
                    "type": "bool",
                    "version_added": "2.0",
                    "version_added_collection": "ansible.builtin"
                },
                "mode": {
                    "description": [
                        "The permissions the resulting file or directory should have.",
                        "For those used to I(/usr/bin/chmod) remember that modes are actually octal numbers. You must either add a leading zero so that Ansible's YAML parser knows it is an octal number (like C(0644) or C(01777)) or quote it (like C('644') or C('1777')) so Ansible receives a string and can do its own conversion from string into number.",
                        "Giving Ansible a number without following one of these rules will end up with a decimal number which will have unexpected results.",
                        "As of Ansible 1.8, the mode may be specified as a symbolic mode (for example, C(u+rwx) or C(u=rw,g=r,o=r))."
                    ],
                    "type": "raw"
                },
                "owner": {
                    "description": [
                        "Name of the user that should own the file/directory, as would be fed to I(chown)."
                    ],
                    "type": "str"
                },
                "remote_src": {
                    "default": false,
                    "description": [
                        "Set to C(yes) to indicate the archived file is already on the remote system and not local to the Ansible controller.",
                        "This option is mutually exclusive with C(copy)."
                    ],
                    "type": "bool",
                    "version_added": "2.2",
                    "version_added_collection": "ansible.builtin"
                },
                "selevel": {
                    "description": [
                        "The level part of the SELinux file context.",
                        "This is the MLS/MCS attribute, sometimes known as the C(range).",
                        "When set to C(_default), it will use the C(level) portion of the policy if available."
                    ],
                    "type": "str"
                },
                "serole": {
                    "description": [
                        "The role part of the SELinux file context.",
                        "When set to C(_default), it will use the C(role) portion of the policy if available."
                    ],
                    "type": "str"
                },
                "setype": {
                    "description": [
                        "The type part of the SELinux file context.",
                        "When set to C(_default), it will use the C(type) portion of the policy if available."
                    ],
                    "type": "str"
                },
                "seuser": {
                    "description": [
                        "The user part of the SELinux file context.",
                        "By default it uses the C(system) policy, where applicable.",
                        "When set to C(_default), it will use the C(user) portion of the policy if available."
                    ],
                    "type": "str"
                },
                "src": {
                    "description": [
                        "If C(remote_src=no) (default), local path to archive file to copy to the target server; can be absolute or relative. If C(remote_src=yes), path on the target server to existing archive file to unpack.",
                        "If C(remote_src=yes) and C(src) contains C(://), the remote machine will download the file from the URL first. (version_added 2.0). This is only for simple cases, for full download support use the M(ansible.builtin.get_url) module."
                    ],
                    "required": true,
                    "type": "path"
                },
                "unsafe_writes": {
                    "default": false,
                    "description": [
                        "Influence when to use atomic operation to prevent data corruption or inconsistent reads from the target file.",
                        "By default this module uses atomic operations to prevent data corruption or inconsistent reads from the target files, but sometimes systems are configured or just broken in ways that prevent this. One example is docker mounted files, which cannot be updated atomically from inside the container and can only be written in an unsafe manner.",
                        "This option allows Ansible to fall back to unsafe methods of updating files when atomic operations fail (however, it doesn't force Ansible to perform unsafe writes).",
                        "IMPORTANT! Unsafe writes are subject to race conditions and can lead to data corruption."
                    ],
                    "type": "bool",
                    "version_added": "2.2",
                    "version_added_collection": "ansible.builtin"
                },
                "validate_certs": {
                    "default": true,
                    "description": [
                        "This only applies if using a https URL as the source of the file.",
                        "This should only set to C(no) used on personally controlled sites using self-signed certificate.",
                        "Prior to 2.2 the code worked as if this was set to C(yes)."
                    ],
                    "type": "bool",
                    "version_added": "2.2",
                    "version_added_collection": "ansible.builtin"
                }
            },
            "seealso": [
                {
                    "module": "community.general.archive"
                },
                {
                    "module": "community.general.iso_extract"
                },
                {
                    "module": "community.windows.win_unzip"
                }
            ],
            "short_description": "Unpacks an archive after (optionally) copying it from the local machine",
            "todo": [
                "Re-implement tar support using native tarfile module.",
                "Re-implement zip support using native zipfile module."
            ],
            "version_added": "1.4",
            "version_added_collection": "ansible.builtin"
        },
        "examples": "\n- name: Extract foo.tgz into /var/lib/foo\n  ansible.builtin.unarchive:\n    src: foo.tgz\n    dest: /var/lib/foo\n\n- name: Unarchive a file that is already on the remote machine\n  ansible.builtin.unarchive:\n    src: /tmp/foo.zip\n    dest: /usr/local/bin\n    remote_src: yes\n\n- name: Unarchive a file that needs to be downloaded (added in 2.0)\n  ansible.builtin.unarchive:\n    src: https://example.com/example.zip\n    dest: /usr/local/bin\n    remote_src: yes\n\n- name: Unarchive a file with extra options\n  ansible.builtin.unarchive:\n    src: /tmp/foo.zip\n    dest: /usr/local/bin\n    extra_opts:\n    - --transform\n    - s/^xxx/yyy/\n",
        "metadata": null,
        "return": null
    }
}
